#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборЖурналаРегистрации = Новый Структура;
	ЗаполнитьСписокУровень();
	ЗаполнитьПараметрыОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
	Если ИмяСобытия = "ВыборЗначенийСвойстваОтбораЖурналаРегистрации"
	   И Источник.УникальныйИдентификатор = УникальныйИдентификатор Тогда
		Если СвойствоИмяЭлемента = Элементы.Пользователи.Имя Тогда
			Пользователи = Параметр;
			ОтборЖурналаРегистрации.Вставить("Пользователи", Пользователи);
		ИначеЕсли СвойствоИмяЭлемента = Элементы.События.Имя Тогда
			События = Параметр;
			ОтборЖурналаРегистрации.Вставить("События", События);
		ИначеЕсли СвойствоИмяЭлемента = Элементы.Компьютеры.Имя Тогда
			Компьютеры = Параметр;
			ОтборЖурналаРегистрации.Вставить("Компьютеры", Компьютеры);
		ИначеЕсли СвойствоИмяЭлемента = Элементы.Приложения.Имя Тогда
			Приложения = Параметр;
			ОтборЖурналаРегистрации.Вставить("Приложения", Приложения);
		ИначеЕсли СвойствоИмяЭлемента = Элементы.Метаданные.Имя Тогда
			Метаданные = Параметр;
			ОтборЖурналаРегистрации.Вставить("Метаданные", Метаданные);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ИнтервалОтбораПриИзменении(Элемент)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ИнтервалОтбораПриИзмененииЗавершение", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ИнтервалОтбора;
	Диалог.Показать(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтбораПриИзмененииЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнтервалОтбора = Период;
	ИнтервалОтбораДатаНачала    = ИнтервалОтбора.ДатаНачала;
	ИнтервалОтбораДатаОкончания = ИнтервалОтбора.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтбораДатаПриИзменении(Элемент)
	
	ИнтервалОтбора.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ИнтервалОтбора.ДатаНачала    = ИнтервалОтбораДатаНачала;
	ИнтервалОтбора.ДатаОкончания = ИнтервалОтбораДатаОкончания;
	ОтборЖурналаРегистрации.Вставить("ДатаНачала", ИнтервалОтбораДатаНачала);
	ОтборЖурналаРегистрации.Вставить("ДатаОкончания", ИнтервалОтбораДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойствоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Перем РедактируемыйСписок, ОтбираемыйПараметр;
	
	ОтключитьСтандартнуюОбработку = Истина;
	СвойствоИмяЭлемента = Элемент.Имя;
	
	Если СвойствоИмяЭлемента = Элементы.Пользователи.Имя Тогда
		РедактируемыйСписок = Пользователи;
		ОтбираемыйПараметр = "ИмяПользователя";
	ИначеЕсли СвойствоИмяЭлемента = Элементы.События.Имя Тогда
		РедактируемыйСписок = События;
		ОтбираемыйПараметр = "ПредставлениеСобытия";
	ИначеЕсли СвойствоИмяЭлемента = Элементы.Компьютеры.Имя Тогда
		РедактируемыйСписок = Компьютеры;
		ОтбираемыйПараметр = "Компьютер";
	ИначеЕсли СвойствоИмяЭлемента = Элементы.Приложения.Имя Тогда
		РедактируемыйСписок = Приложения;
		ОтбираемыйПараметр = "ИмяПриложения";
	ИначеЕсли СвойствоИмяЭлемента = Элементы.Метаданные.Имя Тогда
		РедактируемыйСписок = Метаданные;
		ОтбираемыйПараметр = "Метаданные";
	Иначе
		ОтключитьСтандартнуюОбработку = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ОтключитьСтандартнуюОбработку Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("РедактируемыйСписок", РедактируемыйСписок);
	ПараметрыФормы.Вставить("ОтбираемыйПараметр", ОтбираемыйПараметр);
	
	// Открытие редактора свойства.
	ОткрытьФорму("Обработка.ЖРЖурналРегистрации.Форма.ФормаВыбораСвойстваОтбора",
	             ПараметрыФормы,
	             ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	ОтборЖурналаРегистрации.Вставить("Данные", Данные);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеДанныхПриИзменении(Элемент)
	ОтборЖурналаРегистрации.Вставить("ПредставлениеДанных", ПредставлениеДанных);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ОтборЖурналаРегистрации.Вставить("Комментарий", Комментарий);
КонецПроцедуры

&НаКлиенте
Процедура УровеньПриИзменении(Элемент)
	СписокУровней = Новый СписокЗначений;
	Для Каждого ЭлементСпискаЗначений Из Уровень Цикл
		Если ЭлементСпискаЗначений.Пометка Тогда 
			СписокУровней.Добавить(ЭлементСпискаЗначений.Значение, ЭлементСпискаЗначений.Представление);
		КонецЕсли;
	КонецЦикла;
	Если СписокУровней.Количество() > 0 Тогда
		ОтборЖурналаРегистрации.Вставить("Уровень", СписокУровней);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьЗакрыть(Команда)	
	Закрыть(ПолучитьОтборЖурналаРегистрации());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиУровень(Команда)
	Для Каждого ЭлементСписка Из Уровень Цикл
		ЭлементСписка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиУровень(Команда)
	Для Каждого ЭлементСписка Из Уровень Цикл
		ЭлементСписка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Инициализация

&НаСервере
Процедура ЗаполнитьСписокУровень()
	Уровень.Добавить("Ошибка", "Ошибка", Ложь);
	Уровень.Добавить("Предупреждение", "Предупреждение", Ложь);
	Уровень.Добавить("Информация", "Информация", Ложь);
	Уровень.Добавить("Примечание", "Примечание", Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьОтборЖурналаРегистрации()
	
	Отбор = Новый СписокЗначений;
	
	Если ИнтервалОтбораДатаНачала <> '00010101000000' Тогда 
		Отбор.Добавить(ИнтервалОтбораДатаНачала, "ДатаНачала");
	КонецЕсли;
	Если ИнтервалОтбораДатаОкончания <> '00010101000000' Тогда
		Отбор.Добавить(ИнтервалОтбораДатаОкончания, "ДатаОкончания");
	КонецЕсли;

	Если Пользователи.Количество() > 0 Тогда 
		Отбор.Добавить(Пользователи, "Пользователи");
	КонецЕсли;
	
	Если События.Количество() > 0 Тогда 
		Отбор.Добавить(События, "События");
	КонецЕсли;
	
	Если Компьютеры.Количество() > 0 Тогда 
		Отбор.Добавить(Компьютеры, "Компьютеры");
	КонецЕсли;
	
	Если Приложения.Количество() > 0 Тогда 
		Отбор.Добавить(Приложения, "Приложения");
	КонецЕсли;
	
	Если Не ПустаяСтрока(Комментарий) Тогда 
		Отбор.Добавить(Комментарий, "Комментарий");
	КонецЕсли;
	
	Если Метаданные.Количество() > 0 Тогда 
		Отбор.Добавить(Метаданные, "Метаданные");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Отбор.Добавить(Данные, "Данные");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПредставлениеДанных) Тогда 
		Отбор.Добавить(ПредставлениеДанных, "ПредставлениеДанных");
	КонецЕсли;

	СписокУровней = Новый СписокЗначений;
	Для Каждого ЭлементСпискаЗначений Из Уровень Цикл
		Если ЭлементСпискаЗначений.Пометка Тогда 
			СписокУровней.Добавить(ЭлементСпискаЗначений.Значение, ЭлементСпискаЗначений.Представление);
		КонецЕсли;
	КонецЦикла;
	Если СписокУровней.Количество() > 0  Тогда
		Отбор.Добавить(СписокУровней, "Уровень");
	КонецЕсли;
	Возврат Отбор;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыОтбора()
	
	ЕстьОтборПоУровню = Ложь;
	
	Для Каждого Параметр Из Параметры.ОтборФормы Цикл
		//ИмяПараметра = Параметр.Представление;
		ИмяПараметра = Параметр.Ключ;
		Значение = Параметр.Значение;
		Если ИмяПараметра = "ДатаНачала" Тогда
			ИнтервалОтбораДатаНачала = Значение;
			ИнтервалОтбора.ДатаНачала = Значение;
		ИначеЕсли ИмяПараметра = "ДатаОкончания" Тогда
			ИнтервалОтбораДатаОкончания = Значение;
			ИнтервалОтбора.ДатаОкончания = Значение;
		ИначеЕсли ИмяПараметра = "Уровень" Тогда
			ЕстьОтборПоУровню = Истина;
			Для Каждого ЭлементСпискаЗначений Из Уровень Цикл
				Если Значение.НайтиПоЗначению(ЭлементСпискаЗначений.Значение) <> Неопределено Тогда
					ЭлементСпискаЗначений.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяПараметра = "События" Тогда
			События = Значение;
		ИначеЕсли ИмяПараметра = "Пользователи" Тогда
			Пользователи = Значение;
		ИначеЕсли ИмяПараметра = "Компьютеры" Тогда
			Компьютеры = Значение;
		ИначеЕсли ИмяПараметра = "Приложения" Тогда
			Приложения = Значение;
		ИначеЕсли ИмяПараметра = "Метаданные" Тогда
			Метаданные = Значение;
		ИначеЕсли ИмяПараметра = "Данные" Тогда
			Данные = Значение;
		ИначеЕсли ИмяПараметра = "ПредставлениеДанных" Тогда
			ПредставлениеДанных = Значение;
		ИначеЕсли ИмяПараметра = "Комментарий" Тогда
			Комментарий = Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьОтборПоУровню Тогда
		Для Каждого Элемент Из Уровень Цикл
			Элемент.Пометка = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
