#Область ПрограммныйИнтерфейс

Функция ПодключениеADODB(ПараметрыПодключения) Экспорт
	Если ПараметрыПодключения <> Неопределено
		И ТипЗнч(ПараметрыПодключения) = Тип("СправочникСсылка.ЖРСоединения")
		И ПараметрыПодключения <> Справочники.ЖРСоединения.ПустаяСсылка() Тогда
		Если ЖРСлужебныйСервер.ЭтоWindowsСервер() Тогда
			АДОСоединение = Новый COMОбъект("ADODB.CONNECTION");
		Иначе
			ВызватьИсключение "Ошибка при создании ADODB.CONNECTION. 
			|В настоящий момент функциональность реализована только для Windows сервера";
		КонецЕсли;
		АДОСоединение.Provider = "MSDASQL.1";
		АДОСоединение.ConnectionString = СтрШаблон("Driver={%1};Server=%2;Port=%3;Database=%4;Uid=%5;Pwd=%6;
				|STMT=utf8;TrustServerCertificate=yes;Encrypt=yes;",
				ПараметрыПодключения.Драйвер,
				ПараметрыПодключения.Сервер,
				ПараметрыПодключения.Порт,
				ПараметрыПодключения.БазаДанных,
				ПараметрыПодключения.ПользовательБД,
				ПараметрыПодключения.Пароль
			);
	Иначе
		ВызватьИсключение("Для подключения необходимо передать действительное значение из справочника подключений!!",
			КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	Если АДОСоединение.State <> 1 Тогда
		Попытка
			АДОСоединение.Open();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	Возврат АДОСоединение;
КонецФункции


Функция ПодключениеПоУмолчанию() Экспорт
	ПараметрыПодключения = Справочники.ЖРСоединения.СоединениеПоУмолчанию();
	НовоеПодключение = ПодключениеADODB(ПараметрыПодключения);
	Возврат НовоеПодключение;
КонецФункции

#КонецОбласти