Процедура ОчиститьЗначениеПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖРСоединения.Ссылка КАК Ссылка,
		|	ЖРСоединения.ПоУмолчанию КАК ПоУмолчанию
		|ИЗ
		|	Справочник.ЖРСоединения КАК ЖРСоединения
		|ГДЕ
		|	ЖРСоединения.ПоУмолчанию = &Истина";
	
	Запрос.УстановитьПараметр("Истина", Истина);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Соединение = Выборка.Ссылка.ПолучитьОбъект();
		Соединение.ПоУмолчанию = Ложь;
		Соединение.Записать();
	КонецЦикла;
		
КонецПроцедуры

Функция СоединениеПоУмолчанию() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	ЖРСоединения.Ссылка КАК Ссылка,
		|	ЖРСоединения.ПоУмолчанию КАК ПоУмолчанию
		|ИЗ
		|	Справочник.ЖРСоединения КАК ЖРСоединения
		|ГДЕ
		|	ЖРСоединения.ПоУмолчанию = Истина";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции