
&НаКлиенте
Процедура НазначитьПоУмолчанию(Команда)
	// Вставить содержимое обработчика.	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Для продолжения необходимо записать элемент. Продолжить? ", Режим, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    НазначитьПоУмолчаниюНаСервере();
	Если Объект.ПоУмолчанию = Истина Тогда
		Элементы.ФормаКнопка1.Доступность = Ложь;
	КонецЕсли	
КонецПроцедуры

&НаСервере
Процедура НазначитьПоУмолчаниюНаСервере()
	НачатьТранзакцию();
	Справочники.ЖРСоединения.ОчиститьЗначениеПоУмолчанию();
	//Ссылка = Объект.Ссылка.ПолучитьОбъект();
	//Ссылка.Записать();
	Объект.ПоУмолчанию = Истина;
	ЭтаФорма.Записать();
	ЗафиксироватьТранзакцию();
КонецПроцедуры

//&НаСервере
//Процедура ПриОткрытииНаСервере()
//	// Вставить содержимое обработчика.
//КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.ПоУмолчанию = Истина Тогда
		Элементы.ФормаКнопка1.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
