Функция СведенияОВнешнейОбработке() Экспорт
	
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Синоним = ЭтотОбъект.Метаданные().Синоним; 
	Синоним = ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяОтчета);         
	РегистрационныеДанные = Новый Структура;
	//Вид может быть - ПечатнаяФорма, ЗаполнениеОбъекта (для вн.обработки), ДополнительныйОтчет, СозданиеСвязанныхОбъектов… 
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	РегистрационныеДанные.Вставить("Наименование", Синоним);
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", "Отчет " + Синоним);
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	// Добавим команду в таблицу
	ДобавитьКоманду(ТаблицаКоманд, Синоним, "СформироватьОтчет" , "ОткрытиеФормы", Истина);
	
	// Сохраним таблицу команд в параметры регистрации обработки
	РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, 
	Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    ДатаНачала = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(Настройки, "ДатаНачала");
	ДатаОкончания = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(Настройки, "ДатаОкончания");
	Пользователь = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(Настройки, "Пользователь");
	ДатаОкончания.Использование = истина;
	ДатаНачала.Использование = Истина;
	Пользователь.Использование = Истина;
	ВариантОтчета = Настройки.ДополнительныеСвойства.ВариантНаименование;
	ИмяПользователя = Пользователи.НайтиПоСсылке(Пользователь.Значение);
	Отбор = Новый Структура("ДатаНачала,ДатаОкончания,ИмяПользователя,Вариант", 
		ДатаНачала.Значение, ДатаОкончания.Значение, ИмяПользователя, ВариантОтчета);
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	Если ВариантОтчета = "Анализ активности пользователя (внешний)" Тогда
		ВнешниеНаборыДанных = ВнешнийНаборАнализАктивности(Отбор);
	ИначеЕсли  ВариантОтчета = "Активность пользователя" Тогда
		ВнешниеНаборыДанных = ВнешнийНаборАктивностьПользователя(Отбор);
	Иначе
		ВнешниеНаборыДанных = ВнешнийНаборАнализВарианта(Отбор);
	КонецЕсли;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);	
	ДокументРезультат.Очистить();	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ВнешнийНаборАнализАктивности(Отбор)
	АДОСоединение = ЖРОбщегоНазначения.ПодключениеПоУмолчанию();
	АДОНаборЗаписей = ЖРОбщегоНазначения.АДОРекордСет();
	АДОНаборЗаписей.CursorType = 3;
	АДОКоманда = ЖРОбщегоНазначения.АДОКомандаПоУмолчанию(АДОСоединение);
	ТЗСобытий = Новый ТаблицаЗначений;
	ТЗСобытий.Колонки.Добавить("Дата");
	ТЗСобытий.Колонки.Добавить("Объект");
	ТЗСобытий.Колонки.Добавить("ВидОбъекта");
	ТЗСобытий.Колонки.Добавить("Событие");
	ТЗСобытий.Колонки.Добавить("Количество");
	
	СтрокаПолейВыборки = "date_trunc('day', Дата) as День, ПредставлениеСобытия, 
		|ПредставлениеМетаданных, Данные, COUNT(ПредставлениеМетаданных) as КоличествоСобытий";
	СтрокаУсловияПоУмолчанию = СтрШаблон("Where ИдентификаторИБ='%1' AND ИмяПользователя='%2'", 
		ЖРСлужебныйСервер.ИдентификаторИнформационнойБазы(), Отбор.ИмяПользователя.Имя);
    СтрокаГруппировки = "GROUP BY date_trunc('day', Дата), ПредставлениеСобытия, ПредставлениеМетаданных, Данные 
		|ORDER BY date_trunc('day', Дата)"; 
    СтрокаУсловияПериода = СтрШаблон(" AND (Дата Between '%1' AND '%2')", 
		Формат(Отбор.ДатаНачала, "ДФ=гггг-ММ-дд чч:мм:сс"), 
		Формат(КонецДня(Отбор.ДатаОкончания), "ДФ=гггг-ММ-дд чч:мм:сс")
	);
	СтрокаУсловияОтчета = " AND (ПредставлениеСобытия LIKE 'Данные. Добавление' 
		|OR ПредставлениеСобытия LIKE 'Данные. Изменение' 
		|OR ПредставлениеСобытия LIKE 'Данные. Удаление') 
		|AND (ПредставлениеМетаданных LIKE 'Документ.%' OR ПредставлениеМетаданных LIKE 'Справочник.%')";
	АДОКоманда.CommandText = СтрШаблон("SELECT %1 FROM %2 %3 %4 %5 %6",
		СтрокаПолейВыборки,
		ЖРОбщегоНазначения.ИмяТаблицы(), 
		СтрокаУсловияПоУмолчанию, 
		СтрокаУсловияПериода,
		СтрокаУсловияОтчета,
		СтрокаГруппировки
	);
	Попытка
		АДОНаборЗаписей = АДОКоманда.Execute();
	Исключение
		ЗаписьЖурналаРегистрации("ВнешнийНаборАнализАктивности", 
			УровеньЖурналаРегистрации.Ошибка, , ОписаниеОшибки(), АДОКоманда.CommandText);
	КонецПопытки;
	Пока АДОНаборЗаписей.EOF = 0 Цикл
		НоваяСтрока = ТЗСобытий.Добавить();
		НоваяСтрока.Дата = Дата(АДОНаборЗаписей.Fields("День").Value);
		НоваяСтрока.Объект = ЖРСлужебныйСервер.ЗначениеИзСтрокиXML(АДОНаборЗаписей.Fields("Данные").Value);
		НоваяСтрока.ВидОбъекта = АДОНаборЗаписей.Fields("ПредставлениеМетаданных").Value;
		НоваяСтрока.Событие = АДОНаборЗаписей.Fields("ПредставлениеСобытия").Value;
		НоваяСтрока.Количество = АДОНаборЗаписей.Fields("КоличествоСобытий").Value;
		АДОНаборЗаписей.MoveNext();
	КонецЦикла;

	РезультатОбработки = Новый Структура("АктивностьПользователей", ТЗСобытий);
    Возврат РезультатОбработки;
КонецФункции

Функция ВнешнийНаборАктивностьПользователя(Отбор)

	АДОСоединение = ЖРОбщегоНазначения.ПодключениеПоУмолчанию();
	АДОНаборЗаписей = ЖРОбщегоНазначения.АДОРекордСет();
	АДОКоманда = ЖРОбщегоНазначения.АДОКомандаПоУмолчанию(АДОСоединение);
	ТЗСобытий = Новый ТаблицаЗначений;
	ТЗСобытий.Колонки.Добавить("Дата");
	ТЗСобытий.Колонки.Добавить("Объект");
	ТЗСобытий.Колонки.Добавить("ВидОбъекта");
	ТЗСобытий.Колонки.Добавить("Событие");
	ТЗСобытий.Колонки.Добавить("Количество");
	ТЗСобытий.Колонки.Добавить("Показатель");
	
	СтрокаПолейВыборки = "date_trunc('day', Дата) as День, 
						|CASE WHEN ПредставлениеСобытия LIKE 'Данные. Изменение' THEN 'Изменено'
            			|	WHEN ПредставлениеСобытия LIKE 'Данные. Добавление' THEN 'Введено'
						|	WHEN ПредставлениеСобытия LIKE 'Данные. Удаление' THEN 'Удалено'
       					|END AS Показатель, 
						|CASE WHEN ПредставлениеМетаданных LIKE 'Документ.%' THEN 'Документ'
            			|WHEN ПредставлениеМетаданных LIKE 'Справочник.%' THEN 'Справочник'
       					|END as ГрупировкаМетаданные,
						|COUNT(ПредставлениеСобытия) as Количество";

	СтрокаУсловияПоУмолчанию = СтрШаблон("Where ИмяПользователя='%1'", Отбор.ИмяПользователя.Имя);

	СтрокаГруппировки = "Group by date_trunc('day', Дата), Показатель, 
		|ГрупировкаМетаданные ORDER BY date_trunc('day', Дата)"; 
    СтрокаУсловияПериода = СтрШаблон(" AND (Дата Between '%1' AND '%2')", 
		Формат(Отбор.ДатаНачала, "ДФ=гггг-ММ-дд чч:мм:сс"), 
		Формат(КонецДня(Отбор.ДатаОкончания), "ДФ=гггг-ММ-дд чч:мм:сс")
	);
	СтрокаУсловияОтчета = " AND (ПредставлениеСобытия LIKE 'Данные. Добавление' 
		|OR ПредставлениеСобытия LIKE 'Данные. Изменение' 
		|OR ПредставлениеСобытия LIKE 'Данные. Удаление') 
		|AND (ПредставлениеМетаданных LIKE 'Документ.%' 
		|OR ПредставлениеМетаданных LIKE 'Справочник.%')"
	;
	АДОКоманда.CommandText = СтрШаблон("SELECT %1 FROM %2 %3 %4 %5 %6",
		СтрокаПолейВыборки,
		ЖРОбщегоНазначения.ИмяТаблицы(), 
		СтрокаУсловияПоУмолчанию, 
		СтрокаУсловияПериода,
		СтрокаУсловияОтчета,
		СтрокаГруппировки
	);
	
	Попытка
		АДОНаборЗаписей = АДОКоманда.Execute();
	Исключение
		ЗаписьЖурналаРегистрации("ВнешнийНаборАнализАктивности", 
			УровеньЖурналаРегистрации.Ошибка,
			, 
			ОписаниеОшибки(),
			АДОКоманда.CommandText
		);
	КонецПопытки;
	Пока АДОНаборЗаписей.EOF = 0 Цикл
		НоваяСтрока = ТЗСобытий.Добавить();
		НоваяСтрока.Дата = Дата(АДОНаборЗаписей.Fields("День").Value);
		НоваяСтрока.ВидОбъекта = АДОНаборЗаписей.Fields("ГрупировкаМетаданные").Value;
		НоваяСтрока.Показатель = АДОНаборЗаписей.Fields("Показатель").Value;
		НоваяСтрока.Количество = АДОНаборЗаписей.Fields("Количество").Value;
		АДОНаборЗаписей.MoveNext();
	КонецЦикла;

	РезультатОбработки = Новый Структура("АктивностьПользователей", ТЗСобытий);
    Возврат РезультатОбработки;
КонецФункции

Функция ВнешнийНаборАнализВарианта(Отбор)
	
	ТЗСобытий = Новый ТаблицаЗначений;
	ТЗСобытий.Колонки.Добавить("Дата");
	ТЗСобытий.Колонки.Добавить("Объект");
	ТЗСобытий.Колонки.Добавить("ВидОбъекта");
	ТЗСобытий.Колонки.Добавить("Событие");
	ТЗСобытий.Колонки.Добавить("Количество");
	ТЗСобытий.Колонки.Добавить("Вариант");
	НоваяСтрока = ТЗСобытий.Добавить();
	НоваяСтрока.Вариант = Отбор.Вариант;

	РезультатОбработки = Новый Структура("АктивностьПользователей", ТЗСобытий);
    Возврат РезультатОбработки;
КонецФункции
