
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборЖурналаРегистрации = Новый Структура;                       
	КоличествоЗаписей = 200;
	ОтборЖурналаРегистрации.Вставить("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	ОтборЖурналаРегистрации.Вставить("ДатаОкончания", ТекущаяДатаСеанса());
	ОтборЖурналаРегистрации.Вставить("КоличествоЗаписей", КоличествоЗаписей);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементы();
	ПодключитьОбработчикОжидания("ОбновитьТекущийСписок", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОтборЖурналаРегистрации.Вставить("ДатаНачала", Период.ДатаНачала);
	ОтборЖурналаРегистрации.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ОбновитьПредставлениеОтбора();
КонецПроцедуры

&НаКлиенте
Процедура СписокСобытийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.СписокСобытий.ТекущиеДанные;
	ТекСтрока = Элементы.СписокСобытий.ТекущиеДанные;
	ПараметрыФормы = ПолучитьЗаписьНаСервере(ТекСтрока.Id);
	ОткрытьФорму("Обработка.ЖРЖурналРегистрации.Форма.Событие",ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ОтборЖурналаРегистрации.Вставить("СтрокаПоиска", СтрокаПоиска);
	ОбновитьПредставлениеОтбора();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаписейПриИзменении(Элемент)
	ОтборЖурналаРегистрации.Вставить("КоличествоЗаписей", КоличествоЗаписей);
	ОбновитьПредставлениеОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтбораНаКлиенте()
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОтбора", ЭтаФорма);
	ПараметрыФормы = Новый Структура("ОтборФормы", ОтборЖурналаРегистрации);
	ОткрытьФорму("Обработка.ЖРЖурналРегистрации.Форма.ФормаОтбора",
	             ПараметрыФормы,
	             ЭтотОбъект, , , ,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОтбораНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуОтбораНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПолучитьЗапись(Команда)
	ТекСтрока = Элементы.СписокСобытий.ТекущиеДанные;
	ПараметрыФормы = ПолучитьЗаписьНаСервере(ТекСтрока.Id);
	ОткрытьФорму("Обработка.ЖРЖурналРегистрации.Форма.Событие", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЖурнал(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Продолжить выполнение операции?';"
    + " en = 'Do you want to continue?'"), Режим, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ВыгрузкаЖурналаДлительнаяОперация();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьЖурналЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыгрузитьЖурналЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РезультатПроцедуры = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Комментарий = СтрШаблон("Выгрузка журнала регистрации за период с %1 по %2. Записано в БД - %3, количество записей в журнале - %4",
			Формат(Период.ДатаНачала, "ДФЛ=ДВ"), 
			Формат(Период.ДатаОкончания, "ДФЛ=ДВ"), 
			РезультатПроцедуры.ЗаписаноВБД,
			РезультатПроцедуры.КоличествоЗаписейВЖурнале
		);
	Сообщить(Комментарий);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанные(Команда)
	ОчиститьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтбора(Команда)
	ОткрытьФормуОтбораНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтбора(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОтборЖурналаРегистрации.Очистить();
	Для Каждого ЭлементСписка Из Результат Цикл
		ОтборЖурналаРегистрации.Вставить(ЭлементСписка.Представление, ЭлементСписка.Значение);
	КонецЦикла;
	ОтборЖурналаРегистрации.Вставить("КоличествоЗаписей", КоличествоЗаписей);
	ОбновитьЭлементы();
	ОбновитьТекущийСписок();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийСписок()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ИндикаторДлительныхОпераций;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
		Элементы.ПолеИндикаторДлительныхОпераций, 
		"ФормированиеОтчета"
	);
	
	РезультатВыполнения = ПолучениеДанныхДлительнаяОперация();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьТекущийСписокЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийСписокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ЖурналРегистрации;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
		Элементы.ПолеИндикаторДлительныхОпераций, "НеИспользовать");
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗагрузитьПодготовленныеДанные(Результат.АдресРезультата);
		ПролистатьВКонецСписка();
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПролистатьВКонецСписка();
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементы()
	СтрокаОтбора = "";
	Для Каждого Параметр Из ОтборЖурналаРегистрации Цикл
		ИмяПараметра = Параметр.Ключ;
		Значение = Параметр.Значение;
		Если ИмяПараметра = "ДатаНачала" Тогда
			Период.ДатаНачала = Значение;
		ИначеЕсли ИмяПараметра = "ДатаОкончания" Тогда
			Период.ДатаОкончания = Значение;
		КонецЕсли;	
	КонецЦикла;
	ОбновитьПредставлениеОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеОтбора()
	
	ДатаНачалаИнтервала    = Неопределено;
	ДатаОкончанияИнтервала = Неопределено;
	Если Не ОтборЖурналаРегистрации.Свойство("ДатаНачала", ДатаНачалаИнтервала)
		Или ДатаНачалаИнтервала = Неопределено Тогда
		ДатаНачалаИнтервала    = '00010101000000';
	КонецЕсли;
	
	Если Не ОтборЖурналаРегистрации.Свойство("ДатаОкончания", ДатаОкончанияИнтервала)
		Или ДатаОкончанияИнтервала = Неопределено Тогда
		ДатаОкончанияИнтервала = '00010101000000';
	КонецЕсли;
	
	Если Не (ДатаНачалаИнтервала = '00010101000000' И ДатаОкончанияИнтервала = '00010101000000') Тогда
		ПредставлениеОтбора = ПредставлениеПериода(ДатаНачалаИнтервала, ДатаОкончанияИнтервала) + ", ";
	КонецЕсли;
	Для Каждого Элемент Из ОтборЖурналаРегистрации Цикл
		Если Элемент.Ключ = "ДатаНачала" Или Элемент.Ключ = "ДатаОкончания" Тогда
			Продолжить;
		Иначе
			ПредставлениеОтбора = ПредставлениеОтбора + Строка(Элемент.Значение) + ", ";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузкаЖурналаДлительнаяОперация()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выгрузка журнала регистрации';
															|en = 'Upload event logs'");
	СтруктураПараметров = Новый Структура("ДатаНачала, ДатаОкончания", Период.ДатаНачала, Период.ДатаОкончания);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("ЖРОбщегоНазначения.ЖРВыгрузкаЖурналаВФоне",
		СтруктураПараметров, ПараметрыВыполнения);	
	Возврат ДлительнаяОперация;
КонецФункции

&НаСервере
Процедура ОчиститьДанныеНаСервере()
	СтрокаЗапроса = СтрШаблон("DELETE FROM %1 Where ИдентификаторИБ='%2'",
		ЖРОбщегоНазначения.ИмяТаблицы(), ЖРСлужебныйСервер.ИдентификаторИнформационнойБазы());
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(СтрокаЗапроса);
	ФоновыеЗадания.Выполнить("ЖРОбщегоНазначения.ВыполнитьКомандуНаСервере", МассивПараметров);
	//ЖРОбщегоНазначения.ВыполнитьКомандуНаСервере(СтрокаЗапроса);   
КонецПроцедуры

&НаКлиенте
Процедура ПролистатьВКонецСписка()
	Если СписокСобытий.Количество() > 0 Тогда
		Элементы.СписокСобытий.ТекущаяСтрока = СписокСобытий[СписокСобытий.Количество() - 1].ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучениеДанныхДлительнаяОперация()
	СписокСобытий.Очистить();
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление журнала регистрации';
															|en = 'Updating event log'");
	
	СтруктураПараметров = Новый Структура("Отбор", ОтборЖурналаРегистрации);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("ЖРОбщегоНазначения.ПолучитьДанныеНаСервереВФоне",
		СтруктураПараметров, ПараметрыВыполнения);
	
	Если ДлительнаяОперация.Статус = "Выполняется" Тогда
		ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	КонецЕсли;
	
	Возврат ДлительнаяОперация;	

КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные(Знач АдресРезультата)
	Результат      = ПолучитьИзВременногоХранилища(АдресРезультата);
	СобытияЖурнала = Результат.СобытияЖурнала;
	ЗначениеВДанныеФормы(СобытияЖурнала, СписокСобытий);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаписьНаСервере(Знач Идентификатор)
	Результат = ЖРОбщегоНазначения.ПолучениеЗаписиПоИД(Идентификатор);
	Если Результат.Свойство("ОписаниеОшибки") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Результат.ОписаниеОшибки;
		Сообщение.Сообщить();
		Возврат Неопределено;
	Иначе
		Возврат Результат.СтруктураЗапись;
	КонецЕсли;
КонецФункции

#КонецОбласти

