
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РедактируемыйСписок = Параметры.РедактируемыйСписок;
	ОтбираемыйПараметр = Параметры.ОтбираемыйПараметр;
	ОбновитьСписок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьЗакрыть(Команда)
	Оповестить("ВыборЗначенийСвойстваОтбораЖурналаРегистрации",
		ПолучитьОтредактированныйСписок(), 
		ВладелецФормы);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	Список.ЗаполнитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	Список.ЗаполнитьПометки(Ложь);
КонецПроцедуры

#КонецОбласти

#Область Инициализация

&НаСервере
Процедура ОбновитьСписок()
	ЗначенияОтбора = ЖРОбщегоНазначения.МассивЗначенийСвойстваВЖурналеРегистрации(ОтбираемыйПараметр);
	Для Каждого ЭлементМассива Из ЗначенияОтбора Цикл
		НовыйЭлемент = Список.Добавить();
		Если Не РедактируемыйСписок.НайтиПоЗначению(ЭлементМассива) = Неопределено Тогда
			НовыйЭлемент.Пометка = Истина;
		Иначе
			НовыйЭлемент.Пометка = Ложь;
		КонецЕсли;
		НовыйЭлемент.Значение = ЭлементМассива;
		НовыйЭлемент.Представление = ЭлементМассива;
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	//УстановитьПометкиВыбора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьОтредактированныйСписок()
	РедактируемыйСписок = Новый СписокЗначений;
	РедактируемыйСписок.Очистить();
	Для Каждого Элемент Из Список Цикл
		Если Элемент.Пометка Тогда
			РедактируемыйСписок.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
	КонецЦикла;
	Возврат РедактируемыйСписок;
КонецФункции

&НаСервере
Процедура УстановитьПометкиВыбора()
	Для Каждого Значение Из РедактируемыйСписок Цикл
		ЭлементСписка = Список.НайтиПоЗначению(Значение);
		Если ЭлементСписка <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
