#Область ПрограммныйИнтерфейс

//Параметры:
//	ТекстКоманды - Строка - текст sql запроса
//	Соединение - СправочникСсылка.ЖРСоединения
Процедура ВыполнитьКомандуНаСервере(Знач ТекстКоманды, Соединение = Неопределено) Экспорт
	АДОСоединение = ПодключениеПоУмолчанию(Соединение);
	АДОКоманда = АДОКомандаПоУмолчанию(АДОСоединение);
	АДОКоманда.CommandTimeout = 5000;
	АДОКоманда.CommandText = ТекстКоманды; 
	АДОКоманда.Execute();
	АДОСоединение.Close();
КонецПроцедуры

#Область ЗаписьДанных

// Выгрузка журнала регистрации в фоновом процессе
// Параметры:
//		СтруктураПараметров - Структура:
//								Соединение - Справочники.ЖРСоединения
//								ДатаНачала, ДатаОкончания
//		АдресХранилища - адрес во временном хранилище
// Возвращаемое значение: Структура -
//		ЗаписаноВБД - количество записей успешно внесенных в БД.
//		КоличествоЗаписейВЖурнале - количество записей получено из ЖурналаРегистрации
Процедура ЖРВыгрузкаЖурналаВФоне(СтруктураПараметров, АдресХранилища) Экспорт
	Соединение = Неопределено;
	СтруктураПараметров.Свойство("Соединение", Соединение);
	Если Соединение = Неопределено Тогда
		Соединение = ПодключениеПоУмолчанию();
	КонецЕсли;
	
	Если ПроверкаДатВОтборе(СтруктураПараметров) Тогда
		Результат = ЖРВыгрузкаЖурналаРегистрации(СтруктураПараметров.ДатаНачала, СтруктураПараметров.ДатаОкончания, 0, Соединение);
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректно заданы условия отбора журнала регистрации. 
								|Дата начала больше даты окончания.';
								|en = 'Invalid event log filter settings. 
								|The start date is later than the end date.'");
	КонецЕсли;
КонецПроцедуры

// Выгрузка журнала регистрации в фоновом процессе
// Параметры:
//		СтруктураПараметров - Структура:
//								ДатаНачала - 
//								ДатаОкончания - 
//								КоличествоСобытий - Ограничивает число считываемых методом событий журнала. 
//								Если параметр не указан или равен 0 - без ограничения.
//								Если указано конечное число, метод считывает последние в хронологическом порядке события 
//								с учетом установленного отбора в количестве, не превышающем значения параметра. 
//								Соединение - Справочники.ЖРСоединения
// Возвращаемое значение: Структура -
//		ЗаписаноВБД - количество записей успешно внесенных в БД.
//		КоличествоЗаписейВЖурнале - количество записей получено из ЖурналаРегистрации
Функция ЖРВыгрузкаЖурналаРегистрации(ДатаНачала, ДатаОкончания, КоличествоСобытий, Соединение) Экспорт
	
	// Часто из-за огромного размера журнала регистрации, например в  ERP, не хватает оперативы на сервере 
	// чтобы выгрузить его в таблицу значений за сколь-нибудь небольшой период,
	// иногда даже пару дней вызывает коллапс.
	// Поэтому разбиваем загрузку по часам.
	
	СоздатьТаблицыЖРНаСервереБД(Соединение);
	АДОКоманда = АДОКомандаПоУмолчанию(Соединение);
	ТЗПериодов = ЖРСлужебныйСервер.РазбиениеПериодаНаЧасы(ДатаНачала, ДатаОкончания);
	ЗаписаноВБД = 0;
	РазмерПакета = 200;
	КоличествоЗаписейВЖурналеИтого = 0;
	Для Каждого СтрокаПериодов Из ТЗПериодов Цикл	
		Журнал = СобытияЖурналаРегистрации(Новый Структура("ДатаНачала,ДатаОкончания", 
			СтрокаПериодов.НачалоПериода, СтрокаПериодов.КонецПериода), 0);
		КоличествоЗаписейВЖурнале = Журнал.Количество();
		КоличествоЗаписейВЖурналеИтого = КоличествоЗаписейВЖурналеИтого + КоличествоЗаписейВЖурнале;
		ТекущаяЗапись = 0;
		Пакет = Журнал.СкопироватьКолонки();
		Для Каждого Событие Из Журнал Цикл
			ЗаполнитьЗначенияСвойств(Пакет.Добавить(), Событие);
			ТекущаяЗапись = ТекущаяЗапись + 1;
			Если Пакет.Количество() = РазмерПакета ИЛИ ТекущаяЗапись = КоличествоЗаписейВЖурнале Тогда
				АДОКоманда.CommandText = ТекстЗапросаВставкиДанныхЖурнала(Пакет);
				Попытка
		        		АДОКоманда.Execute();
					ЗаписаноВБД = ЗаписаноВБД + Пакет.Количество();
				Исключение
					ЗаписьЖурналаРегистрации("ВыгрузкаЖурналаРегистрации", 
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.ОбщиеМодули.ЖРОбщегоНазначения, 
						ОписаниеОшибки(),
						АДОКоманда.CommandText
					); 
				КонецПопытки;
				Пакет.Очистить();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Соединение.Close();
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаписаноВБД", ЗаписаноВБД);
	Результат.Вставить("КоличествоЗаписейВЖурнале", КоличествоЗаписейВЖурналеИтого);
	Возврат Результат;
КонецФункции

Процедура ЖРВыгрузкаЖурналаРегистрацииЗаПредДень() Экспорт
	АДОСоединение = ПодключениеПоУмолчанию();
	ДатаНачала = НачалоДня(ТекущаяДатаСеанса() - 86400);
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса() - 86400);
	РезультатВыгрузки = ЖРВыгрузкаЖурналаРегистрации(ДатаНачала, ДатаОкончания, 0, АДОСоединение);
	Комментарий = СтрШаблон("Выгрузка журнала регистрации за период с %1 по %2. Записано в БД - %3, количество записей в журнале - %4",
		Формат(ДатаНачала, "ДФЛ=ДВ"), 
		Формат(ДатаОкончания, "ДФЛ=ДВ"), 
		РезультатВыгрузки.ЗаписаноВБД,
		РезультатВыгрузки.КоличествоЗаписейВЖурнале
	);
	ЗаписьЖурналаРегистрации("ВыгрузкаЖурналаРегистрацииЗаПредДень", 
						УровеньЖурналаРегистрации.Информация,
						Метаданные.ОбщиеМодули.ЖРОбщегоНазначения, 
						Комментарий
					);
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных

// Получение данных на сервере Postgres в таблицу значений
// Параметры:
//	Отбор - Структура
//	Соединение - СправочникСсылка.ЖРСоединения, 
//Возвращаемое значение: ТаблицаЗначений из событий
Функция ПолучитьДанныеНаСервере(Отбор, Соединение) Экспорт
	
	ТЗСобытий = Новый ТаблицаЗначений;
	АДОСоединение = ПодключениеПоУмолчанию(Соединение);
	
	АДОНаборЗаписей = АДОРекордСет();
	АДОКоманда = АДОКомандаПоУмолчанию(АДОСоединение);
	АДОКоманда.CommandText = СтрШаблон("SELECT * FROM %1 %2 %3", 
		ИмяТаблицы(), 
		СтрокаУсловияПоУмолчанию(), 
		ОтборВСтрокуУсловия(Отбор)
	);
	Попытка
		АДОНаборЗаписей = АДОКоманда.Execute();
	Исключение
		ЗаписьЖурналаРегистрации("ПолучитьДанныеНаСервере", 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ЖРОбщегоНазначения,
			ОписаниеОшибки(),
			АДОКоманда.CommandText
		);
		Возврат Неопределено;
	КонецПопытки;
	Пока АДОНаборЗаписей.EOF = 0 Цикл    // Заполнение созданной таблицы 
		НоваяСтрока = ТЗСобытий.Добавить();
		НоваяСтрока.Id = АДОНаборЗаписей.Fields("Id").Value;
		НоваяСтрока.ИдентификаторИБ = АДОНаборЗаписей.Fields("ИдентификаторИБ").Value;
		НоваяСтрока.Уровень = АДОНаборЗаписей.Fields("Уровень").Value;
		НоваяСтрока.Дата = АДОНаборЗаписей.Fields("Дата").Value;
		НоваяСтрока.Пользователь = АДОНаборЗаписей.Fields("Пользователь").Value;
		НоваяСтрока.ИмяПользователя = АДОНаборЗаписей.Fields("ИмяПользователя").Value;
		НоваяСтрока.Компьютер = АДОНаборЗаписей.Fields("Компьютер").Value;
		НоваяСтрока.ИмяПриложения = АДОНаборЗаписей.Fields("ИмяПриложения").Value;
		НоваяСтрока.Событие = АДОНаборЗаписей.Fields("Событие").Value;
		НоваяСтрока.ПредставлениеСобытия = АДОНаборЗаписей.Fields("ПредставлениеСобытия").Value;
		НоваяСтрока.Комментарий = АДОНаборЗаписей.Fields("Комментарий").Value;
		НоваяСтрока.Метаданные = АДОНаборЗаписей.Fields("Метаданные").Value;
		НоваяСтрока.ПредставлениеМетаданных = АДОНаборЗаписей.Fields("ПредставлениеМетаданных").Value;
		НоваяСтрока.Данные = ЖРСлужебныйСервер.ЗначениеИзСтрокиXML(АДОНаборЗаписей.Fields("Данные").Value);
		НоваяСтрока.ПредставлениеДанных = АДОНаборЗаписей.Fields("ПредставлениеДанных").Value;
		НоваяСтрока.ПредставлениеПриложения = АДОНаборЗаписей.Fields("ПредставлениеПриложения").Value;
		НоваяСтрока.СтатусТранзакции = АДОНаборЗаписей.Fields("СтатусТранзакции").Value;
		НоваяСтрока.Транзакция = АДОНаборЗаписей.Fields("Транзакция").Value;
		НоваяСтрока.Сеанс = АДОНаборЗаписей.Fields("Сеанс").Value;
		НоваяСтрока.Соединение = АДОНаборЗаписей.Fields("Соединение").Value;
		НоваяСтрока.РабочийСервер = АДОНаборЗаписей.Fields("РабочийСервер").Value;
		НоваяСтрока.ОсновнойIPПорт = АДОНаборЗаписей.Fields("ОсновнойIPПорт").Value;
		НоваяСтрока.ВспомогательныйIPПорт = АДОНаборЗаписей.Fields("ВспомогательныйIPПорт").Value;
		Попытка
			НоваяСтрока.РазделениеДанныхСеанса = ЖРСлужебныйСервер.ЗначениеИзСтрокиXML(
				АДОНаборЗаписей.Fields("РазделениеДанныхСеанса").Value);
			НоваяСтрока.ПредставлениеРазделенияДанныхСеанса = АДОНаборЗаписей.Fields(
				"ПредставлениеРазделенияДанныхСеанса").Value;
		Исключение
			НоваяСтрока.РазделениеДанныхСеанса = "";
			НоваяСтрока.ПредставлениеРазделенияДанныхСеанса = "";
		КонецПопытки;
		АДОНаборЗаписей.MoveNext();	
	КонецЦикла;
	АДОНаборЗаписей.Close();
	АДОСоединение.Close();
	
	Возврат ТЗСобытий;
КонецФункции

// Получение данных для формы обработки ЖРЖурналРегистрации
// Параметры:
//	СтруктураПараметров - Структура:
//		Отбор - Структура
//		Соединение - СправочникСсылка.ЖРСоединения
//	АдресХранилища - Строка
Процедура ПолучитьДанныеНаСервереВФоне(СтруктураПараметров, АдресХранилища) Экспорт
	
	Соединение = Неопределено;
	СтруктураПараметров.Свойство("Соединение", Соединение);
	АДОСоединение = ПодключениеПоУмолчанию(Соединение);
	АДОНаборЗаписей = АДОРекордСет();
	АДОКоманда = АДОКомандаПоУмолчанию(АДОСоединение);
	АДОКоманда.CommandText = СтрШаблон("SELECT 
		|	Id,
		|	Уровень,
		|	Дата,
		|	ИмяПользователя,
		|	Компьютер,
		|	ПредставлениеСобытия,
		|	Комментарий,
		|	ПредставлениеМетаданных,
		|	ПредставлениеДанных,
		|	ПредставлениеПриложения,
		|	Сеанс 
		|FROM %1 %2 %3", ИмяТаблицы(), СтрокаУсловияПоУмолчанию(), ОтборВСтрокуУсловия(СтруктураПараметров.Отбор));
	Попытка
		АДОНаборЗаписей = АДОКоманда.Execute();
	Исключение
		ЗаписьЖурналаРегистрации("ПолучитьДанныеНаСервереВФоне", 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ЖРОбщегоНазначения,
			ОписаниеОшибки(),
			АДОКоманда.CommandText
		);
		Возврат;
	КонецПопытки;
	ТЗСобытий = Новый ТаблицаЗначений;
	ТЗСобытий.Колонки.Добавить("Id");
	ТЗСобытий.Колонки.Добавить("Уровень");
	ТЗСобытий.Колонки.Добавить("Дата");
	ТЗСобытий.Колонки.Добавить("ИмяПользователя");
	ТЗСобытий.Колонки.Добавить("Компьютер");
	ТЗСобытий.Колонки.Добавить("ПредставлениеСобытия");
	ТЗСобытий.Колонки.Добавить("Комментарий");
	ТЗСобытий.Колонки.Добавить("ПредставлениеМетаданных");
	ТЗСобытий.Колонки.Добавить("ПредставлениеДанных");
	ТЗСобытий.Колонки.Добавить("ПредставлениеПриложения");
	ТЗСобытий.Колонки.Добавить("Сеанс");	
	
	Пока АДОНаборЗаписей.EOF=0 Цикл    // Заполнение созданной таблицы 
		НоваяСтрока = ТЗСобытий.Добавить();
		НоваяСтрока.Id = АДОНаборЗаписей.Fields("Id").Value;
		НоваяСтрока.Уровень = АДОНаборЗаписей.Fields("Уровень").Value;
		НоваяСтрока.Дата = АДОНаборЗаписей.Fields("Дата").Value;
		НоваяСтрока.ИмяПользователя = АДОНаборЗаписей.Fields("ИмяПользователя").Value;
		НоваяСтрока.Компьютер = АДОНаборЗаписей.Fields("Компьютер").Value;
		НоваяСтрока.ПредставлениеСобытия = АДОНаборЗаписей.Fields("ПредставлениеСобытия").Value;
		НоваяСтрока.Комментарий = АДОНаборЗаписей.Fields("Комментарий").Value;
		НоваяСтрока.ПредставлениеМетаданных = АДОНаборЗаписей.Fields("ПредставлениеМетаданных").Value;
		НоваяСтрока.ПредставлениеДанных = АДОНаборЗаписей.Fields("ПредставлениеДанных").Value;
		НоваяСтрока.ПредставлениеПриложения = АДОНаборЗаписей.Fields("ПредставлениеПриложения").Value;
		НоваяСтрока.Сеанс = АДОНаборЗаписей.Fields("Сеанс").Value;
		АДОНаборЗаписей.MoveNext();
		
	КонецЦикла;
	АДОНаборЗаписей.Close();
	АДОСоединение.Close();
	
		// Успешное завершение
	Результат = Новый Структура;
	Результат.Вставить("СобытияЖурнала", ТЗСобытий);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

Процедура ПолучитьЗаписьПоИДНаСервереВФоне(Отбор, АдресХранилища) Экспорт
	
	Ид = Неопределено;
	ИдЗаполнено = Отбор.Свойство("Id", Ид);
	Если Не ИдЗаполнено Тогда
		Результат = Новый Структура;
		Результат.Вставить("ОписаниеОшибки", "Для поиска по идентификатору необходимо передать этот идентификатор!!))");
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
		Возврат;
	КонецЕсли;
	Соединение = Неопределено;
	Отбор.Свойство("Соединение", Соединение);
	АДОСоединение = ПодключениеПоУмолчанию(Соединение);
	АДОНаборЗаписей = АДОРекордСет();
	АДОКоманда = АДОКомандаПоУмолчанию(АДОСоединение);
	АДОКоманда.CommandText = СтрШаблон("SELECT * FROM %1 Where Id='%2'", ИмяТаблицы(), Ид);
	Попытка
		АДОНаборЗаписей = АДОКоманда.Execute();
	Исключение
		ЗаписьЖурналаРегистрации("ПолучитьЗаписьПоИДНаСервереВФоне", 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ЖРОбщегоНазначения, 
			ОписаниеОшибки(),
			АДОКоманда.CommandText
		);
		Возврат;
	КонецПопытки;

	Попытка
		АДОНаборЗаписей.MoveFirst();
	Исключение
		Результат = Новый Структура;
		Результат.Вставить("ОписаниеОшибки", "Отсутствуют данные по указанному идентификатору!!");
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
		Возврат;
	КонецПопытки;
	СтруктураЗапись = Новый Структура;
	СтруктураЗапись.Вставить("Id", АДОНаборЗаписей.Fields("Id").Value);
	СтруктураЗапись.Вставить("ИдентификаторИБ", АДОНаборЗаписей.Fields("ИдентификаторИБ").Value);
	СтруктураЗапись.Вставить("Уровень", АДОНаборЗаписей.Fields("Уровень").Value);
	СтруктураЗапись.Вставить("Дата", АДОНаборЗаписей.Fields("Дата").Value);
	СтруктураЗапись.Вставить("Пользователь", АДОНаборЗаписей.Fields("Пользователь").Value);
	СтруктураЗапись.Вставить("ИмяПользователя", АДОНаборЗаписей.Fields("ИмяПользователя").Value);
	СтруктураЗапись.Вставить("Компьютер", АДОНаборЗаписей.Fields("Компьютер").Value);
	СтруктураЗапись.Вставить("ИмяПриложения", АДОНаборЗаписей.Fields("ИмяПриложения").Value);
	СтруктураЗапись.Вставить("Событие", АДОНаборЗаписей.Fields("Событие").Value);
	СтруктураЗапись.Вставить("ПредставлениеСобытия", АДОНаборЗаписей.Fields("ПредставлениеСобытия").Value);
	СтруктураЗапись.Вставить("Комментарий", АДОНаборЗаписей.Fields("Комментарий").Value);
	СтруктураЗапись.Вставить("Метаданные", АДОНаборЗаписей.Fields("Метаданные").Value);
	СтруктураЗапись.Вставить("ПредставлениеМетаданных", АДОНаборЗаписей.Fields("ПредставлениеМетаданных").Value);
	СтруктураЗапись.Вставить("Данные", ЖРСлужебныйСервер.ЗначениеИзСтрокиXML(АДОНаборЗаписей.Fields("Данные").Value));
	СтруктураЗапись.Вставить("ПредставлениеДанных", АДОНаборЗаписей.Fields("ПредставлениеДанных").Value);
	СтруктураЗапись.Вставить("ПредставлениеПриложения", АДОНаборЗаписей.Fields("ПредставлениеПриложения").Value);
	СтруктураЗапись.Вставить("СтатусТранзакции", АДОНаборЗаписей.Fields("СтатусТранзакции").Value);
	СтруктураЗапись.Вставить("Транзакция", АДОНаборЗаписей.Fields("Транзакция").Value);
	СтруктураЗапись.Вставить("Сеанс", АДОНаборЗаписей.Fields("Сеанс").Value);
	СтруктураЗапись.Вставить("Соединение", АДОНаборЗаписей.Fields("Соединение").Value);
	СтруктураЗапись.Вставить("РабочийСервер", АДОНаборЗаписей.Fields("РабочийСервер").Value);
	СтруктураЗапись.Вставить("ОсновнойIPПорт", АДОНаборЗаписей.Fields("ОсновнойIPПорт").Value);
	СтруктураЗапись.Вставить("ВспомогательныйIPПорт", АДОНаборЗаписей.Fields("ВспомогательныйIPПорт").Value);
	Попытка
		СтруктураЗапись.Вставить("РазделениеДанныхСеанса", 
			ЖРСлужебныйСервер.ЗначениеИзСтрокиXML(АДОНаборЗаписей.Fields("РазделениеДанныхСеанса").Value));
	Исключение
		СтруктураЗапись.Вставить("РазделениеДанныхСеанса", "");
	КонецПопытки;
	Попытка
		СтруктураЗапись.Вставить("ПредставлениеРазделенияДанныхСеанса", 
			АДОНаборЗаписей.Fields("ПредставлениеРазделенияДанныхСеанса").Value);
	Исключение
		СтруктураЗапись.Вставить("ПредставлениеРазделенияДанныхСеанса", "");
	КонецПопытки;
	АДОНаборЗаписей.Close();
	АДОСоединение.Close();
	
		// Успешное завершение
	Результат = Новый Структура;
	Результат.Вставить("СтруктураЗапись", СтруктураЗапись);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

// Параметры:
//	Идентификатор - Число (bigserial) - Id записи в БД
//	Соединение - СправочникСсылка.ЖРСоединения
// Возвращаемое значение:
//	Результат - Структрура:
//		ОписаниеОшибки - Строка
//		СтруктураЗапись - Структура - 
//			
Функция ПолучениеЗаписиПоИД(Знач Идентификатор, Соединение=Неопределено) Экспорт
	АДОСоединение = ПодключениеПоУмолчанию(Соединение);
	АДОНаборЗаписей = АДОРекордСет();
	АДОКоманда = АДОКомандаПоУмолчанию(АДОСоединение);
	АДОКоманда.CommandText = СтрШаблон("SELECT * FROM %1 Where Id=%2", 
		ИмяТаблицы(), 
		Формат(Идентификатор,"ЧГ=0; ЧН=; ЧРД="".""")
	);
	Попытка
		АДОНаборЗаписей = АДОКоманда.Execute();
	Исключение
		ЗаписьЖурналаРегистрации("ПолучениеЗаписиПоИД", 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ЖРОбщегоНазначения, 
			ОписаниеОшибки(),
			АДОКоманда.CommandText
		);
		Результат = Новый Структура;
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;

	Попытка
		АДОНаборЗаписей.MoveFirst();
	Исключение
		Результат = Новый Структура;
		Результат.Вставить("ОписаниеОшибки", "Отсутствуют данные по указанному идентификатору!!");
		Возврат Результат;
	КонецПопытки;
	СтруктураЗапись = Новый Структура;
	СтруктураЗапись.Вставить("Id", АДОНаборЗаписей.Fields("Id").Value);
	СтруктураЗапись.Вставить("ИдентификаторИБ", АДОНаборЗаписей.Fields("ИдентификаторИБ").Value);
	СтруктураЗапись.Вставить("Уровень", АДОНаборЗаписей.Fields("Уровень").Value);
	СтруктураЗапись.Вставить("Дата", АДОНаборЗаписей.Fields("Дата").Value);
	СтруктураЗапись.Вставить("Пользователь", АДОНаборЗаписей.Fields("Пользователь").Value);
	СтруктураЗапись.Вставить("ИмяПользователя", АДОНаборЗаписей.Fields("ИмяПользователя").Value);
	СтруктураЗапись.Вставить("Компьютер", АДОНаборЗаписей.Fields("Компьютер").Value);
	СтруктураЗапись.Вставить("ИмяПриложения", АДОНаборЗаписей.Fields("ИмяПриложения").Value);
	СтруктураЗапись.Вставить("Событие", АДОНаборЗаписей.Fields("Событие").Value);
	СтруктураЗапись.Вставить("ПредставлениеСобытия", АДОНаборЗаписей.Fields("ПредставлениеСобытия").Value);
	СтруктураЗапись.Вставить("Комментарий", АДОНаборЗаписей.Fields("Комментарий").Value);
	СтруктураЗапись.Вставить("Метаданные", АДОНаборЗаписей.Fields("Метаданные").Value);
	СтруктураЗапись.Вставить("ПредставлениеМетаданных", АДОНаборЗаписей.Fields("ПредставлениеМетаданных").Value);
	СтруктураЗапись.Вставить("Данные", ЖРСлужебныйСервер.ЗначениеИзСтрокиXML(АДОНаборЗаписей.Fields("Данные").Value));
	СтруктураЗапись.Вставить("ПредставлениеДанных", АДОНаборЗаписей.Fields("ПредставлениеДанных").Value);
	СтруктураЗапись.Вставить("ПредставлениеПриложения", АДОНаборЗаписей.Fields("ПредставлениеПриложения").Value);
	СтруктураЗапись.Вставить("СтатусТранзакции", АДОНаборЗаписей.Fields("СтатусТранзакции").Value);
	СтруктураЗапись.Вставить("Транзакция", АДОНаборЗаписей.Fields("Транзакция").Value);
	СтруктураЗапись.Вставить("Сеанс", АДОНаборЗаписей.Fields("Сеанс").Value);
	СтруктураЗапись.Вставить("Соединение", АДОНаборЗаписей.Fields("Соединение").Value);
	СтруктураЗапись.Вставить("РабочийСервер", АДОНаборЗаписей.Fields("РабочийСервер").Value);
	СтруктураЗапись.Вставить("ОсновнойIPПорт", АДОНаборЗаписей.Fields("ОсновнойIPПорт").Value);
	СтруктураЗапись.Вставить("ВспомогательныйIPПорт", АДОНаборЗаписей.Fields("ВспомогательныйIPПорт").Value);
	Попытка
		СтруктураЗапись.Вставить("РазделениеДанныхСеанса", 
			ЖРСлужебныйСервер.ЗначениеИзСтрокиXML(АДОНаборЗаписей.Fields("РазделениеДанныхСеанса").Value));
	Исключение
		СтруктураЗапись.Вставить("РазделениеДанныхСеанса", "");
	КонецПопытки;
	Попытка
		СтруктураЗапись.Вставить("ПредставлениеРазделенияДанныхСеанса", 
			АДОНаборЗаписей.Fields("ПредставлениеРазделенияДанныхСеанса").Value);
	Исключение
		СтруктураЗапись.Вставить("ПредставлениеРазделенияДанныхСеанса", "");
	КонецПопытки;
	АДОНаборЗаписей.Close();
	АДОСоединение.Close();
	
		// Успешное завершение
	Результат = Новый Структура;
	Результат.Вставить("СтруктураЗапись", СтруктураЗапись);
	
	Возврат Результат;

КонецФункции

Процедура ПолучитьСписокЗначенийСвойстваВФоне(СтруктураПараметров, АдресХранилища) Экспорт
	
	Соединение = Неопределено;
	СтруктураПараметров.Свойство("Соединение", Соединение);
	ОтбираемыйПараметр = СтруктураПараметров.ОтбираемыйПараметр;
	МассивЗначенийСвойства = МассивЗначенийСвойстваВЖурналеРегистрации(ОтбираемыйПараметр, Соединение);
	Результат = Новый Структура;
	Результат.Вставить("МассивЗначенийСвойства", МассивЗначенийСвойства);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

//Параметры:
//	ОтбираемыйПараметр - Строка - имя колонки в таблице
//	Соединение = СправочникСсылка.ЖРСоединения
//
// Возвращаемое значение:
//	Массив - массив сгруппированных значений из колонки в таблице
Функция МассивЗначенийСвойстваВЖурналеРегистрации(ОтбираемыйПараметр, Соединение = Неопределено)  Экспорт
	МассивЗначенийСвойства = Новый Массив;
	Если Соединение = Неопределено Тогда
		АДОСоединение = ПодключениеПоУмолчанию();
	Иначе
		АДОСоединение = ПодключениеADODB(Соединение);
	КонецЕсли;
	АДОНаборЗаписей = АДОРекордСет();
	АДОКоманда = АДОКомандаПоУмолчанию(АДОСоединение);
	АДОКоманда.CommandText = СтрШаблон("SELECT %1 FROM %2 %3 GROUP BY %1", 
		ОтбираемыйПараметр, 
		ИмяТаблицы(), 
		СтрокаУсловияПоУмолчанию()
	);
	Попытка
		АДОНаборЗаписей = АДОКоманда.Execute();
	Исключение
		ЗаписьЖурналаРегистрации("СписокЗначенийСвойстваВЖурналеРегистрации", 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ЖРОбщегоНазначения, 
			ОписаниеОшибки(),
			АДОКоманда.CommandText
		);
		Возврат МассивЗначенийСвойства;
	КонецПопытки;
	
	Пока АДОНаборЗаписей.EOF = 0 Цикл
		МассивЗначенийСвойства.Добавить(АДОНаборЗаписей.Fields(ОтбираемыйПараметр).Value);
		АДОНаборЗаписей.MoveNext();
	КонецЦикла;
	АДОНаборЗаписей.Close();
	АДОСоединение.Close();
	Возврат МассивЗначенийСвойства;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяТаблицы() Экспорт
	Возврат "ЖурналРегистрации1с";
КонецФункции		

// Параметры:
//	ПараметрыПодключения - СправочникСсылка.ЖРСоединения
// Возвращаемое значение:
//	- открытое соединение ADODB.CONNECTION
Функция ПодключениеADODB(ПараметрыПодключения) Экспорт
	Если ПараметрыПодключения <> Неопределено
		И ТипЗнч(ПараметрыПодключения) = Тип("СправочникСсылка.ЖРСоединения")
		И ПараметрыПодключения <> Справочники.ЖРСоединения.ПустаяСсылка() Тогда
		Если ЖРСлужебныйСервер.ЭтоWindowsСервер() Тогда
			АДОСоединение = Новый COMОбъект("ADODB.CONNECTION");
		Иначе
			ВызватьИсключение "Ошибка при создании ADODB.CONNECTION. 
			|В настоящий момент функциональность реализована только для Windows сервера";
		КонецЕсли;
		АДОСоединение.Provider = ПараметрыПодключения.Провайдер; //"MSDASQL.1";
		АДОСоединение.ConnectionString = СтрШаблон("Driver={%1};Server=%2;Port=%3;Database=%4;Uid=%5;Pwd=%6;
				|STMT=utf8;TrustServerCertificate=yes;Encrypt=yes;",
				ПараметрыПодключения.Драйвер,
				ПараметрыПодключения.Сервер,
				ПараметрыПодключения.Порт,
				ПараметрыПодключения.БазаДанных,
				ПараметрыПодключения.ПользовательБД,
				ПараметрыПодключения.Пароль
			);
	Иначе
		ВызватьИсключение("Для подключения необходимо передать действительное значение из справочника подключений!!",
			КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	Если АДОСоединение.State <> 1 Тогда
		АДОСоединение.Open();
	КонецЕсли;
	Возврат АДОСоединение;
КонецФункции

// 
// Возвращаемое значение:
//	- открытое соединение ADODB.CONNECTION 
Функция ПодключениеПоУмолчанию(ПараметрыПодключения=Неопределено) Экспорт
	Если ПараметрыПодключения = Неопределено 
		ИЛИ ПараметрыПодключения = Справочники.ЖРСоединения.ПустаяСсылка() 
		ИЛИ ТипЗнч(ПараметрыПодключения) <> Тип("СправочникСсылка.ЖРСоединения") Тогда
		ПараметрыПодключения = Справочники.ЖРСоединения.СоединениеПоУмолчанию();
	КонецЕсли;
	НовоеПодключение = ПодключениеADODB(ПараметрыПодключения);
	Возврат НовоеПодключение;
КонецФункции


Функция АДОКомандаПоУмолчанию(АДОСоединение = Неопределено) Экспорт
	Если АДОСоединение = Неопределено Тогда
		АДОСоединение = ПодключениеПоУмолчанию();
	КонецЕсли;
	Если ЖРСлужебныйСервер.ЭтоWindowsСервер() Тогда
		АДОКоманда = Новый COMОбъект("ADODB.Command");
		АДОКоманда.CommandTimeout = 500;
		АДОКоманда.ActiveConnection = АДОСоединение;
		Возврат АДОКоманда;
	Иначе
		ВызватьИсключение "Ошибка при создании ADODB.Command. 
		|В настоящий момент функциональность реализована только для Windows сервера";
	КонецЕсли;
	
КонецФункции

Функция АДОРекордСет() Экспорт
	
	Если ЖРСлужебныйСервер.ЭтоWindowsСервер() Тогда
		Возврат Новый COMОбъект("ADODB.RecordSet");
	Иначе
		ВызватьИсключение "Ошибка при создании ADODB.RecordSet. 
		|В настоящий момент функциональность реализована только для Windows сервера";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьТаблицыЖРНаСервереБД(Соединение)
	
	АДОКоманда = АДОКомандаПоУмолчанию(Соединение);
	АДОКоманда.CommandText = ТекстЗапросаСозданияТаблицБД();
	АДОКоманда.Execute();
КонецПроцедуры

Функция ТекстЗапросаСозданияТаблицБД()

	СтрокаЗапроса = "CREATE TABLE IF NOT EXISTS " + ИмяТаблицы() +  " (
	|	Id bigserial PRIMARY KEY,
	|	ИдентификаторИБ text,
	|	Уровень  text,
	|	Дата timestamp,
	|	Пользователь text,
	|	ИмяПользователя text,
	|	Компьютер text,
	|	ИмяПриложения text,
	|	Событие text,
	|	ПредставлениеСобытия text,
	|	Комментарий text,
	|	Метаданные text,
	|	ПредставлениеМетаданных text,
	|	Данные text,
	|	ПредставлениеДанных text,
	|   ПредставлениеПриложения text,
	|	СтатусТранзакции text,
	|	Транзакция text,
	|	Сеанс integer,
	|   Соединение integer,
	|   РабочийСервер text,
	|	ОсновнойIPПорт integer,
	|	ВспомогательныйIPПорт text,
	|	РазделениеДанныхСеанса text,
	|	ПредставлениеРазделенияДанныхСеанса text);
	
	|	CREATE INDEX IF NOT EXISTS ix_database_id
	|    ON " + ИмяТаблицы() + " USING hash
	|    (ИдентификаторИБ COLLATE pg_catalog.default)
	|    TABLESPACE pg_default;


	|CREATE INDEX IF NOT EXISTS ix_date
	|    ON " + ИмяТаблицы() + " USING btree
	|    (Дата ASC NULLS LAST)
	|    WITH (deduplicate_items=False)
	|    TABLESPACE pg_default;


	|CREATE INDEX IF NOT EXISTS ix_event
	|    ON " + ИмяТаблицы() + " USING btree
	|    (ПредставлениеСобытия COLLATE pg_catalog.default ASC NULLS LAST)
	|    INCLUDE(Событие)
	|    WITH (deduplicate_items=True)
	|    TABLESPACE pg_default;


	|CREATE INDEX IF NOT EXISTS ix_level
	|    ON " + ИмяТаблицы() + " USING btree
	|    (Уровень COLLATE pg_catalog.default ASC NULLS LAST)
	|    WITH (deduplicate_items=False)
	|    TABLESPACE pg_default;


	|CREATE INDEX IF NOT EXISTS ix_metadata
	|    ON " + ИмяТаблицы() + " USING btree
	|    (ПредставлениеМетаданных COLLATE pg_catalog.default ASC NULLS LAST)
	|    INCLUDE(Метаданные)
	|    WITH (deduplicate_items=True)
	|    TABLESPACE pg_default;


	|CREATE INDEX IF NOT EXISTS ix_username
	|    ON " + ИмяТаблицы() + " USING btree
	|    (ИмяПользователя COLLATE pg_catalog.default ASC NULLS LAST)
	|    WITH (deduplicate_items=True)
	|    TABLESPACE pg_default;";
	
	Возврат СтрокаЗапроса;
КонецФункции

Функция УстановитьСтрокуДанных(Знач Данные)
	
	ДанныеСтрокой = ЗначениеВСтрокуВнутр(Данные);
	УточненнаяСтрока = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ДанныеСтрокой);
	
	Если ДанныеСтрокой <> УточненнаяСтрока Тогда
		Попытка
			ЗначениеИзСтрокиВнутр(УточненнаяСтрока);
			ДанныеСтрокой = УточненнаяСтрока;
		Исключение
			ДанныеСтрокой = "";
		КонецПопытки;
	КонецЕсли;
	Возврат ДанныеСтрокой;
	
КонецФункции

Функция ЗаполнениеСтрокиВставки(СтрокаЖурнала, Знач СтрокаЗаписи)

	// Экранируем для Postgre одинарные кавычки и слеши
	КоличествоКолонок = СтрокаЖурнала.Владелец().Колонки.Количество() - 1;
	Для Индекс=0 По КоличествоКолонок Цикл
	//Для Каждого Значение Из СтрокаЖурнала Цикл
		СтрокаЖурнала[Индекс] = СтрЗаменить(СтрокаЖурнала[Индекс], Символ(39), Символ(34));
		СтрокаЖурнала[Индекс] = СтрЗаменить(СтрокаЖурнала[Индекс], "\", "\\");
		СтрокаЖурнала[Индекс] = СтрЗаменить(СтрокаЖурнала[Индекс], Символы.НПП, "");
	КонецЦикла;

	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ИдентификаторИБ", ЖРСлужебныйСервер.ИдентификаторИнформационнойБазы());
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Уровень", СтрокаЖурнала.Уровень);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Дата", Формат(СтрокаЖурнала.Дата, "ДФ=гггг-ММ-дд чч:мм:сс"));
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Пользователь", СтрокаЖурнала.Пользователь);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ИмяПользователя", СтрокаЖурнала.ИмяПользователя);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Компьютер", СтрокаЖурнала.Компьютер);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ИмяПриложения", СтрокаЖурнала.ИмяПриложения);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Событие", СтрокаЖурнала.Событие);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ПредставлениеСобытия", СтрокаЖурнала.ПредставлениеСобытия);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Комментарий", СтрокаЖурнала.Комментарий);
	Если ТипЗнч(СтрокаЖурнала.Метаданные) = Тип("Массив") Тогда
		СтрокаЖурналаМетаданные = СтрСоединить(СтрокаЖурнала.Метаданные, "| ");
	Иначе
		СтрокаЖурналаМетаданные = Строка(СтрокаЖурнала.Метаданные);
	КонецЕсли;
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Метаданные", Строка(СтрокаЖурналаМетаданные));
	Если ТипЗнч(СтрокаЖурнала.ПредставлениеМетаданных) = Тип("Массив") Тогда
		ПредставлениеМетаданных = СтрСоединить(СтрокаЖурнала.ПредставлениеМетаданных, "| ");
	Иначе
		ПредставлениеМетаданных = СтрокаЖурнала.ПредставлениеМетаданных;
	КонецЕсли;	
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ПредставлениеМетаданных", ПредставлениеМетаданных);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Данные", ЖРСлужебныйСервер.ЗначениеВСтрокуXML(СтрокаЖурнала.Данные));
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ПредставлениеДанных", СтрокаЖурнала.ПредставлениеДанных);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ПредставлениеПриложения", СтрокаЖурнала.ПредставлениеПриложения);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#СтатусТранзакции", Строка(СтрокаЖурнала.СтатусТранзакции));
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Транзакция", СтрокаЖурнала.Транзакция);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Сеанс", ?(Формат(СтрокаЖурнала.Сеанс, "ЧГ=0")="",0, Формат(СтрокаЖурнала.Сеанс, "ЧГ=0")));
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#Соединение", Формат(СтрокаЖурнала.Соединение, "ЧН="));
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#РабочийСервер", СтрокаЖурнала.РабочийСервер);
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ОсновнойIPПорт", Формат(СтрокаЖурнала.ОсновнойIPПорт, "ЧН="));
	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ВспомогательныйIPПорт", СтрокаЖурнала.ВспомогательныйIPПорт);
	Если СтрНайти(СтрокаЗаписи, "#РазделениеДанныхСеанса") <> 0 Тогда
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#РазделениеДанныхСеанса", ЖРСлужебныйСервер.ЗначениеВСтрокуXML(СтрокаЖурнала.РазделениеДанныхСеанса));
    	СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, "#ПредставлениеРазделенияДанныхСеанса", стрСоединить(СтрокаЖурнала.ПредставлениеРазделенияДанныхСеанса, "| "));
	КонецЕсли;
	Возврат СтрокаЗаписи;
КонецФункции

Функция ТекстЗапросаВставкиДанныхЖурнала(СобытияЖурнала)
	СтрокаЗапроса = "INSERT INTO " + ИмяТаблицы() +  " (
	|	ИдентификаторИБ,	Уровень, Дата, Пользователь, ИмяПользователя, Компьютер, ИмяПриложения, Событие,
	|	ПредставлениеСобытия, Комментарий, Метаданные, ПредставлениеМетаданных, Данные, ПредставлениеДанных,
	|   ПредставлениеПриложения, СтатусТранзакции,	Транзакция, Сеанс, Соединение, РабочийСервер,
	|	ОсновнойIPПорт, ВспомогательныйIPПорт";
	
	СтрокаЗаписи = "('#ИдентификаторИБ', '#Уровень', '#Дата', '#Пользователь', '#ИмяПользователя', '#Компьютер', 
	|'#ИмяПриложения', '#Событие', '#ПредставлениеСобытия', '#Комментарий', '#Метаданные', 
	|'#ПредставлениеМетаданных', '#Данные', '#ПредставлениеДанных', '#ПредставлениеПриложения', '#СтатусТранзакции',
	|'#Транзакция', '#Сеанс', '#Соединение', '#РабочийСервер', '#ОсновнойIPПорт', '#ВспомогательныйIPПорт'";
	
	Если СобытияЖурнала.Колонки.Найти("РазделениеДанныхСеанса") <> Неопределено Тогда
		СтрокаЗапроса = СтрокаЗапроса + ", РазделениеДанныхСеанса"; 
	    СтрокаЗаписи = СтрокаЗаписи + ", '#РазделениеДанныхСеанса'";
	КонецЕсли;
	
	Если СобытияЖурнала.Колонки.Найти("ПредставлениеРазделенияДанныхСеанса") <> Неопределено Тогда
		СтрокаЗапроса = СтрокаЗапроса + ", 'ПредставлениеРазделенияДанныхСеанса'"; 
	    СтрокаЗаписи = СтрокаЗаписи + ", '#ПредставлениеРазделенияДанныхСеанса'";
	КонецЕсли;
	СтрокаЗапроса = СтрокаЗапроса + ") VALUES "; 
	СтрокаЗаписи = СтрокаЗаписи + ")";
	
	СтрокаЗначений = "";
	Для Каждого Событие Из СобытияЖурнала Цикл
		СтрокаВставки = ЗаполнениеСтрокиВставки(Событие, СтрокаЗаписи);
		СтрокаЗначений = СтрокаЗначений + СтрокаВставки + ","; 
	КонецЦикла;
	СтрокаЗначений = Лев(СтрокаЗначений, СтрДлина(СтрокаЗначений) - 1);
	СтрокаЗапроса = СтрокаЗапроса + СтрокаЗначений;
	Возврат СтрокаЗапроса;
КонецФункции

// Возвращает таблицу значений выгруженных записей из журнала регистрации.
// Параметры:
//	Отбор - см. ВыгрузитьЖурналРегистрации
//	КоличествоСобытий - см. ВыгрузитьЖурналРегистрации
Функция СобытияЖурналаРегистрации(Отбор, КоличествоСобытий = 0)

	Если ПроверкаДатВОтборе(Отбор) Тогда
		Журнал = Новый ТаблицаЗначений;
		ВыгрузитьЖурналРегистрации(Журнал, Отбор, , , КоличествоСобытий);
		Возврат Журнал;
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректно заданы условия отбора журнала регистрации. 
								|Дата начала больше даты окончания.';
								|en = 'Invalid event log filter settings. 
								|The start date is later than the end date.'");
	КонецЕсли;
КонецФункции

// Проверка дат в отборе
// Отбор - Структура
Функция ПроверкаДатВОтборе(Отбор)
	ДатаНачала    = Неопределено;
	ДатаОкончания = Неопределено;
	ДатыОтбораУказаны = Отбор.Свойство("ДатаНачала", ДатаНачала) 
		И Отбор.Свойство("ДатаОкончания", ДатаОкончания)
		И ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания);
		
	Если ДатыОтбораУказаны И ДатаНачала > ДатаОкончания Тогда
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

// Преобразует список значений отбора в строку условия для Postgres
// Параметры:
//		Отбор - СписокЗначений или Структура
Функция ОтборВСтрокуУсловия(Отбор)
	
	СтрокаУсловия = "";
	СтруктураОтбор = Новый Структура;
	Если ТипЗнч(Отбор) = Тип("СписокЗначений") Тогда
		Для Каждого ЭлементСписка Из Отбор Цикл
			СтруктураОтбор.Вставить(ЭлементСписка.Представление, ЭлементСписка.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Отбор) = Тип("Структура") Тогда
		СтруктураОтбор = Отбор;
	КонецЕсли;

	Если ПроверкаДатВОтборе(СтруктураОтбор) Тогда
		СтрокаУсловия = СтрШаблон(" AND Дата>= '%1' AND Дата<='%2'", 
				Формат(СтруктураОтбор.ДатаНачала, "ДФ=гггг-ММ-дд чч:мм:сс"), 
				Формат(СтруктураОтбор.ДатаОкончания, "ДФ=гггг-ММ-дд чч:мм:сс"));
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректно заданы условия отбора журнала регистрации. Дата начала больше даты окончания.';
						|en = 'Invalid event log filter settings. The start date is later than the end date.'");
	КонецЕсли;
	
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("Уровень", СтруктураОтбор);
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("Пользователи", СтруктураОтбор);
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("Компьютеры", СтруктураОтбор);
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("События", СтруктураОтбор);
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("Приложения", СтруктураОтбор);
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("Метаданные", СтруктураОтбор);
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("Данные", СтруктураОтбор);
	СтрокаУсловия = СтрокаУсловия + ПоказательОтбораВСтрокуУсловия("ПредставлениеДанных", СтруктураОтбор);
	
	Комментарий = Неопределено;
	Если СтруктураОтбор.Свойство("Комментарий", Комментарий) И ЗначениеЗаполнено(Комментарий) Тогда
		СтрокаУсловия = СтрокаУсловия + " AND (Комментарий ILIKE " + "'%" + Комментарий + "%')"; 
	КонецЕсли;

	СтрокаПоиска = Неопределено;
	Если СтруктураОтбор.Свойство("СтрокаПоиска", СтрокаПоиска) И ЗначениеЗаполнено(СтрокаПоиска) Тогда
		СтрокаПоиска = СтруктураОтбор.СтрокаПоиска;
		Если СтрДлина(СтрокаПоиска) > 2 Тогда
			СтрокаУсловия = СтрокаУсловия + " AND (Компьютер ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR ИмяПриложения ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR ПредставлениеПриложения ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR Событие ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR ПредставлениеСобытия ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR Комментарий ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR Метаданные ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR ПредставлениеМетаданных ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR ПредставлениеДанных ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR СтатусТранзакции ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR Транзакция ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR РабочийСервер ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR РазделениеДанныхСеанса ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR ПредставлениеРазделенияДанныхСеанса ILIKE '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR Сеанс = '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR Соединение = '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + " OR ОсновнойIPПорт = '%" + СтрокаПоиска + "%'";
			СтрокаУсловия = СтрокаУсловия + ")";	
		ИначеЕсли СтрДлина(СтрокаПоиска) < 3 И СтрДлина(СтрокаПоиска) > 0 Тогда
			ВызватьИсключение НСтр("ru = 'Строка поиска должна быть не менее 3-х символов.';
								|en = 'The search string must be at least 3 characters long.'");
		КонецЕсли;
	КонецЕсли;
	
	СтрокаУсловия = СтрокаУсловия + " ORDER BY Дата";	
	КоличествоЗаписей = Неопределено;
	Если СтруктураОтбор.Свойство("КоличествоЗаписей", КоличествоЗаписей) И КоличествоЗаписей > 0 Тогда
		СтрокаУсловия = СтрокаУсловия + СтрШаблон(" LIMIT %1", Формат(КоличествоЗаписей, "ЧГ=0"));
	КонецЕсли;
	Возврат СтрокаУсловия;
		
КонецФункции

Функция ПоказательОтбораВСтрокуУсловия(Показатель, Отбор)
	СоответствиеПоказателей = Новый Соответствие;
	// Ключ  как указано в отборе, значение - имя поля в таблице
	СоответствиеПоказателей.Вставить("Пользователи", "Пользователь");
	СоответствиеПоказателей.Вставить("Компьютеры", "Компьютер");
	СоответствиеПоказателей.Вставить("События", "Событие");
	СоответствиеПоказателей.Вставить("Приложения", "ИмяПриложения");
	СоответствиеПоказателей.Вставить("Уровень", "Уровень");
	СоответствиеПоказателей.Вставить("Метаданные", "Метаданные");
	СоответствиеПоказателей.Вставить("Данные", "Данные");
	СоответствиеПоказателей.Вставить("ПредставлениеДанных", "ПредставлениеДанных");

	Значение = Неопределено;
	СтрокаУсловия = "";
	Если Отбор.Свойство(Показатель, Значение) И ЗначениеЗаполнено(Значение) Тогда
		СтрокаУсловия = " AND (";
		Для Каждого Элемент Из Значение Цикл
			СтрокаУсловия = СтрокаУсловия + СтрШаблон("%1='%2' OR ", СоответствиеПоказателей[Показатель] , Элемент.Значение);
		КонецЦикла;
		СтрокаУсловия = Сред(СтрокаУсловия, 1 , СтрДлина(СтрокаУсловия) - 4);
		СтрокаУсловия = СтрокаУсловия + ")";
	КонецЕсли;
	Возврат СтрокаУсловия;
КонецФункции

Функция СтрокаУсловияПоУмолчанию()
	Возврат СтрШаблон("Where ИдентификаторИБ='%1'", ЖРСлужебныйСервер.ИдентификаторИнформационнойБазы());
КонецФункции

#КонецОбласти

// Уровень (Level) - тип УровеньЖурналаРегистрации;
//Дата (Date) - тип Дата;
//Пользователь (User) - идентификатор пользователя, тип УникальныйИдентификатор;
//Компьютер (Computer) - имя компьютера, тип Строка;
//ИмяПриложения (ApplicationName) - имя приложения, тип Строка;
//Событие (Event ) - имя события, тип Строка;
//Комментарий (Comment) - комментарий, тип Строка;
//Метаданные (Metadata) - имя объекта метаданных, тип Строка; 
//	для событий "Доступ. Доступ" и "Доступ. Отказ в доступе" в этой колонке может содержаться 
//	массив имен объектов метаданных, тип Массив;
//Данные (Data) - данные, произвольного типа, в зависимости от события;
//ПредставлениеДанных (DataPresentation) - представление данных, тип Строка;
//ИмяПользователя (UserName) - имя пользователя, тип Строка;
//ПредставлениеПриложения (ApplicationPresentation) - представление имени приложения, тип Строка;
//ПредставлениеСобытия (EventPresentation) - представление события, тип Строка;
//ПредставлениеМетаданных (MetadataPresentation) - представление объекта метаданных; тип Строка; 
//	для событий "Доступ. Доступ" и "Доступ. Отказ в доступе" в этой колонке может содержаться 
//	массив представлений объектов метаданных, тип Массив;
//СтатусТранзакции (TransactionStatus) - статус транзакции, тип СтатусТранзакцииЗаписиЖурналаРегистрации;
//Транзакция (TransactionID) - представление транзакции, тип Строка;
//Сеанс (Session) - номер сеанса, тип Число;
//Соединение (Connection) - номер соединения, тип Число;
//РабочийСервер (ServerName) - имя рабочего сервера, тип Строка;
//ОсновнойIPПорт (Port) - номер основного IP-порта, тип Число;
//ВспомогательныйIPПорт (SyncPort) - номер вспомогательного IP-порта, тип Строка;
//РазделениеДанныхСеанса (SessionDataSeparation) - Структура с элементами, имена которых соответствуют 
//	именам общих реквизитов, разделяющих данные, а значения - значениям этих общих реквизитов;
//ПредставлениеРазделенияДанныхСеанса (SessionDataSeparationPresentation) - 
//	Массив строк вида: <представление общего реквизита>: <представление значения общего реквизита>.
