Функция ИдентификаторИнформационнойБазы() Экспорт
	
	Если НЕ ПустаяСтрока(Метаданные.Константы.Найти("ИдентификаторИнформационнойБазы")) Тогда
		ИдентификаторИнформационнойБазы = Константы.ИдентификаторИнформационнойБазы.Получить();
	КонецЕсли;
	Если ПустаяСтрока(ИдентификаторИнформационнойБазы) Тогда
		ИдентификаторИнформационнойБазы = Константы.ИдентификаторИБ.Получить();
	КонецЕсли;
	Если ПустаяСтрока(ИдентификаторИнформационнойБазы) Тогда
		ИдентификаторИнформационнойБазы = Строка(Новый УникальныйИдентификатор());
		
		УстановитьОтключениеБезопасногоРежима(Истина);
		УстановитьПривилегированныйРежим(Истина);
		
		Константы.ИдентификаторИБ.Установить(ИдентификаторИнформационнойБазы);
		
		УстановитьПривилегированныйРежим(Ложь);
		УстановитьОтключениеБезопасногоРежима(Ложь);
	КонецЕсли;
	
	Возврат ИдентификаторИнформационнойБазы;
	
КонецФункции

Функция ЭтоWindowsСервер() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
КонецФункции

Функция СтруктураВСтроку(Структура) Экспорт
	Текст = "";
	Для Каждого Элемент Из Структура Цикл
		//добавим разделитель после предыдущего значения
		Текст = Текст + ?(НЕ ПустаяСтрока(Текст), Символы.ПС, "");
		//добавим представление ключа и значения:
		Текст = Текст + Элемент.Ключ + ": " + Элемент.Значение;
	КонецЦикла;
	Возврат Текст;
КонецФункции

// Преобразует (сериализует) любое значение в XML-строку.
// Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
// См. также ЗначениеИзСтрокиXML.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//  Строка - XML-строка.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Выполняет преобразование (десериализацию) XML-строки в значение.
// См. также ЗначениеВСтрокуXML.
//
// Параметры:
//  СтрокаXML - Строка - XML-строка, с сериализованным объектом..
//
// Возвращаемое значение:
//  Произвольный - значение, полученное из переданной XML-строки.
//
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
КонецФункции

Функция РазбиениеПериодаНаЧасы(Знач ДатаНачала, Знач ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
			|    НАЧАЛОПЕРИОДА(&ДатаНачала, ЧАС) КАК Период
			|ИТОГИ ПО
			|    Период ПЕРИОДАМИ(ЧАС, &ДатаНачала, &ДатаОкончания)");
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
	ТЗПериодов = Новый ТаблицаЗначений;
	ТЗПериодов.Колонки.Добавить("НачалоПериода");
	ТЗПериодов.Колонки.Добавить("КонецПериода");
	Пока Выборка.Следующий() Цикл
		строка = ТЗПериодов.Добавить();
		строка.НачалоПериода = Выборка.Период;
		строка.КонецПериода = КонецЧаса(Выборка.Период);
	КонецЦикла;
	ТЗПериодов[0].НачалоПериода = ДатаНачала;
	ТЗПериодов.Получить(ТЗПериодов.Количество()-1).КонецПериода = ДатаОкончания;
	Возврат ТЗПериодов;
КонецФункции

Функция ТаблицаРолей(Роли) Экспорт
	
	РолиПользователяИБ = Новый ТаблицаЗначений;
	РолиПользователяИБ.Колонки.Добавить("Существует");
	РолиПользователяИБ.Колонки.Добавить("Представление", , НСтр("ru = 'Представление';
			|en = 'Presentation'"));
	
	Для Каждого ПолноеИмяРоли Из Роли Цикл
		ЧастиИмени = СтрРазделить(ПолноеИмяРоли, ".", Ложь);
		Если ЧастиИмени.Количество() = 2 Тогда
			ИмяРоли = ЧастиИмени[1];
			МетаданныеРоли = Метаданные.Роли.Найти(ИмяРоли);
		Иначе
			ИмяРоли = ПолноеИмяРоли;
		КонецЕсли;
		НоваяСтрока = РолиПользователяИБ.Добавить();
		НоваяСтрока.Существует = МетаданныеРоли <> Неопределено;
		НоваяСтрока.Представление = ?(МетаданныеРоли = Неопределено,
				ИмяРоли, МетаданныеРоли.Представление());
	КонецЦикла;
	
	РолиПользователяИБ.Сортировать("Существует УБЫВ, Представление");
	РолиПользователяИБ.Колонки.Удалить("Существует");
	
	Возврат РолиПользователяИБ;
	
КонецФункции

Функция ДеревоИзДанныхСтруктуры(ДанныеСобытия, ПредставлениеКлючей = Неопределено,
		ТолькоЗаполненные = Ложь, ИсключаемыеСвойства = Неопределено) Экспорт
	
	Если ПредставлениеКлючей = Неопределено Тогда
		ПредставлениеКлючей = ПредставлениеКлючейСтруктур();
	КонецЕсли;
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Свойство", Новый ОписаниеТипов("Строка"), НСтр("ru = 'Свойство';
			|en = 'Property'"));
	Дерево.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"), НСтр("ru = 'Значение';
			|en = 'Value'"));
	Дерево.Колонки.Добавить("СвойствоБезПредставления", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("ЕстьЗначение", Новый ОписаниеТипов("Булево"));
	
	ДобавитьСвойстваВДерево(Дерево.Строки, ДанныеСобытия, ПредставлениеКлючей,
		ТолькоЗаполненные, ИсключаемыеСвойства);
	
	Дерево.Колонки.Удалить("СвойствоБезПредставления");
	
	Возврат Дерево;
	
КонецФункции

Процедура ДобавитьСвойстваВДерево(СтрокиДерева, ОписаниеСвойств, ПредставлениеКлючей,
		ТолькоЗаполненные, ИсключаемыеСвойства, Знач КлючРодителя = "")
	
	Если КлючРодителя <> "" Тогда
		КлючРодителя = КлючРодителя + ".";
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ОписаниеСвойств Цикл
		ПолныйКлюч = КлючРодителя + КлючИЗначение.Ключ;
		Значение = КлючИЗначение.Значение;
		
		Если ИсключаемыеСвойства <> Неопределено
			И ИсключаемыеСвойства.Получить(НРег(ПолныйКлюч)) <> Неопределено
			ИЛИ ТолькоЗаполненные
			И НЕ ЗначениеЗаполнено(Значение)
			И ТипЗнч(Значение) <> Тип("Булево")
			И ТипЗнч(Значение) <> Тип("Число")
			И ТипЗнч(Значение) <> Тип("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СтрокиДерева.Добавить();
		
		Если ТипЗнч(ОписаниеСвойств) = Тип("Соответствие")
			ИЛИ ТипЗнч(ОписаниеСвойств) = Тип("ФиксированноеСоответствие") Тогда
			
			НоваяСтрока.Свойство = ПредставлениеЗначения("", КлючИЗначение.Ключ);
		Иначе
			НоваяСтрока.Свойство = ПредставлениеКлючей.Получить(НРег(КлючИЗначение.Ключ));
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Свойство) Тогда
				НоваяСтрока.Свойство = КлючИЗначение.Ключ;
				НоваяСтрока.СвойствоБезПредставления = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Значение) = Тип("Структура")
			ИЛИ ТипЗнч(Значение) = Тип("ФиксированнаяСтруктура")
			ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			ИЛИ ТипЗнч(Значение) = Тип("ФиксированноеСоответствие") Тогда
			
			ДобавитьСвойстваВДерево(НоваяСтрока.Строки, Значение, ПредставлениеКлючей,
				ТолькоЗаполненные, ИсключаемыеСвойства, ПолныйКлюч);
			
		ИначеЕсли (ТипЗнч(Значение) = Тип("Массив")
				ИЛИ ТипЗнч(Значение) = Тип("ФиксированныйМассив"))
			И Значение.Количество() > 0
			И (ТипЗнч(Значение[0]) = Тип("Структура")
				ИЛИ ТипЗнч(Значение[0]) = Тип("ФиксированнаяСтруктура")
				ИЛИ ТипЗнч(Значение[0]) = Тип("Соответствие")
				ИЛИ ТипЗнч(Значение[0]) = Тип("ФиксированноеСоответствие")) Тогда
			
			ЧислоСимволов = СтрДлина(XMLСтрока(Значение.Количество()));
			Номер = 1;
			Для Каждого ЭлементМассива Из Значение Цикл
				НоваяПодстрока = НоваяСтрока.Строки.Добавить();
				НоваяПодстрока.Свойство = Прав("         " + XMLСтрока(Номер), ЧислоСимволов);
				ДобавитьСвойстваВДерево(НоваяПодстрока.Строки, ЭлементМассива, ПредставлениеКлючей,
					ТолькоЗаполненные, ИсключаемыеСвойства, ПолныйКлюч);
				Номер = Номер + 1;
			КонецЦикла;
		Иначе
			ПредставлениеЗначения = ПредставлениеЗначения(ПолныйКлюч, Значение);
			НоваяСтрока.Значение = ПредставлениеЗначения;
			НоваяСтрока.ЕстьЗначение = Истина;
		КонецЕсли;
		
		Если НЕ ТолькоЗаполненные Тогда
			Продолжить;
		КонецЕсли;
		
		Если НоваяСтрока.ЕстьЗначение
			И НЕ ЗначениеЗаполнено(ПредставлениеЗначения)
			ИЛИ НЕ НоваяСтрока.ЕстьЗначение
			И НЕ ЗначениеЗаполнено(НоваяСтрока.Строки) Тогда
			
			СтрокиДерева.Удалить(НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиДерева.Сортировать("СвойствоБезПредставления, Свойство");
	
КонецПроцедуры

Функция ПредставлениеЗначения(Ключ, Значение)
	
	ФорматнаяСтрока = НСтр("ru = 'ЧН=0; ДЛФ=DT; ДП=''01.01.0001 00:00:00''';
			|en = 'NZ=0; DLF=DT; DE=''01.01.0001 00:00:00'''");
	
	Если ТипЗнч(Значение) <> Тип("Массив") Тогда
		Если ВРег(Ключ) = ВРег("ИмяСобытия") И СтрНачинаетсяС(Значение, "_$") Тогда
			ПредставлениеСобытия = ПредставлениеСобытияЖурналаРегистрации(Значение);
			Если ЗначениеЗаполнено(ПредставлениеСобытия) Тогда
				Возврат ПредставлениеСобытия;
			КонецЕсли;
		КонецЕсли;
		Возврат ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(
			Формат(Значение, ФорматнаяСтрока));
	КонецЕсли;
	
	Если ВРег(Ключ) = ВРег("Роли") Тогда
		Таблица = ТаблицаРолей(Значение);
		Строки = Таблица.ВыгрузитьКолонку("Представление");
		Соединитель = Символы.ПС;
	Иначе
		Строки = Новый Массив;
		Для Каждого ТекущееЗначение Из Значение Цикл
			Строки.Добавить(ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(
					Формат(ТекущееЗначение, ФорматнаяСтрока)));
		КонецЦикла;
		Соединитель = ", ";
	КонецЕсли;
	
	Если Строки.Количество() = 1 Тогда
		Возврат Строки[0];
	КонецЕсли;
	
	Возврат СтрСоединить(Строки, Соединитель);
	
КонецФункции

Функция ПредставлениеКлючейСтруктур()
	
	Результат = Новый Соответствие;
	
	// _$Access$_.*
	Результат.Вставить(НРег("Право"),
		НСтр("ru = 'Право';
			|en = 'Access right'"));
	
	Результат.Вставить(НРег("Действие"),
		НСтр("ru = 'Действие';
			|en = 'Action'"));
	
	// _$Debug$_.*
	Результат.Вставить(НРег("ПользовательСервераОтладки"),
		НСтр("ru = 'Пользователь сервера отладки';
			|en = 'Debug server user'"));
	
	Результат.Вставить(НРег("ТипПредметаОтладки"),
		НСтр("ru = 'Тип предмета отладки';
			|en = 'Debug item type'"));
	
	Результат.Вставить(НРег("Выражение"),
		НСтр("ru = 'Выражение';
			|en = 'Expression'"));
	
	// _$InfoBase$_.AdditionalAuthenticationSettingsUpdate
	Результат.Вставить(НРег("СпособВосстановленияПароля"),
		НСтр("ru = 'Способ восстановления пароля';
			|en = 'Password recovery method'"));
	
	Результат.Вставить(НРег("НавигационнаяСсылкаВосстановленияПароля"),
		НСтр("ru = 'Навигационная ссылка восстановления пароля';
			|en = 'Password recovery URL'"));
	
	Результат.Вставить(НРег("НавигационнаяСсылкаПомощи"),
		НСтр("ru = 'Навигационная ссылка помощи';
			|en = 'Help URL'"));
	
	Результат.Вставить(НРег("ОтображатьГиперссылкуПомощи"),
		НСтр("ru = 'Отображать гиперссылку помощи';
			|en = 'Show Help URL'"));
	
	Результат.Вставить(НРег("ДлинаКодаПодтверждения"),
		НСтр("ru = 'Длина кода подтверждения';
			|en = 'Confirmation code length'"));
	
	Результат.Вставить(НРег("МаксимальноеКоличествоНеуспешныхПопытокПроверкиКодаПодтверждения"),
		НСтр("ru = 'Максимальное количество неуспешных попыток проверки кода подтверждения';
			|en = 'Limit for unsuccessful code entries'"));
	
	Результат.Вставить(НРег("ДлительностьБлокировкиЗапросаОбновленияКодаПодтверждения"),
		НСтр("ru = 'Длительность блокировки запроса обновления кода подтверждения';
			|en = 'Confirmation code cooldown time'"));
	
	Результат.Вставить(НРег("АдресСервераSMTP"),
		НСтр("ru = 'Адрес сервера SMTP';
			|en = 'SMTP server address'"));
	
	Результат.Вставить(НРег("ПользовательSMTP"),
		НСтр("ru = 'Пользователь SMTP';
			|en = 'SMTP user'"));
	
	Результат.Вставить(НРег("ПарольSMTPИзменен"),
		НСтр("ru = 'Пароль SMTP изменен';
			|en = 'SMTP password changed'"));
	
	Результат.Вставить(НРег("ПортSMTP"),
		НСтр("ru = 'Порт SMTP';
			|en = 'SMTP port'"));
	
	Результат.Вставить(НРег("ИмяОтправителя"),
		НСтр("ru = 'Имя отправителя';
			|en = 'Sender name'"));
	
	Результат.Вставить(НРег("Заголовок"),
		НСтр("ru = 'Заголовок';
			|en = 'Header'"));
	
	Результат.Вставить(НРег("ТекстСообщенияHTML"),
		НСтр("ru = 'Текст сообщения HTML';
			|en = 'HTML message body'"));
	
	Результат.Вставить(НРег("ИспользоватьSSL"),
		НСтр("ru = 'Использовать SSL';
			|en = 'SSL user'"));
	
	Результат.Вставить(НРег("РазрешитьСохранениеАутентификацииДляПовторнойАутентификации"),
		НСтр("ru = 'Разрешить сохранение аутентификации для повторной аутентификации';
			|en = 'Allow save credentials for auto-login'"));
	
	Результат.Вставить(НРег("СохранятьАутентификациюДляПовторнойАутентификацииПоУмолчанию"),
		НСтр("ru = 'Сохранять аутентификацию для повторной аутентификации по умолчанию';
			|en = 'Save credentials for auto-login by default'"));
	
	Результат.Вставить(НРег("ВремяЖизниСохраненнойАутентификации"),
		НСтр("ru = 'Время жизни сохраненной аутентификации';
			|en = 'Credentials lifetime'"));
	
	// _$InfoBase$_.AdministrationParametersChange
	Результат.Вставить(НРег("БлокировкаРегламентныхЗаданий"),
		НСтр("ru = 'Блокировка регламентных заданий';
			|en = 'Scheduled job lock'"));
	
	Результат.Вставить(НРег("ВключенаБлокировкаНачалаСеансов"),
		НСтр("ru = 'Включена блокировка начала сеансов';
			|en = 'Session startup lock enabled'"));
	
	Результат.Вставить(НРег("ВремяНачалаБлокировки"),
		НСтр("ru = 'Время начала блокировки';
			|en = 'Lock start time'"));
	
	Результат.Вставить(НРег("ВремяОкончанияБлокировки"),
		НСтр("ru = 'Время окончания блокировки';
			|en = 'Lock end time'"));
	
	Результат.Вставить(НРег("ЗадержкаВыгрузкиКонфигурацииРабочимПроцессомБезАктивныхПользователей"),
		НСтр("ru = 'Задержка выгрузки конфигурации рабочим процессом без активных пользователей';
			|en = 'Delay for importing configuration by an idle process'"));
	
	Результат.Вставить(НРег("ЗапретитьЛокальноеРаспознаваниеРечи"),
		НСтр("ru = 'Запретить локальное распознавание речи';
			|en = 'Restrict local speech recognition'"));
	
	Результат.Вставить(НРег("ИдентификаторИнформационнойБазы"),
		НСтр("ru = 'Идентификатор информационной базы';
			|en = 'Infobase ID'"));
	
	Результат.Вставить(НРег("ИмяБазыДанных"),
		НСтр("ru = 'Имя базы данных';
			|en = 'Database name'"));
	
	Результат.Вставить(НРег("КодРазрешенияНачалаСеансов"),
		НСтр("ru = 'Код разрешения начала сеансов';
			|en = 'Access code for session startup'"));
	
	Результат.Вставить(НРег("МаксимальныйСдвигЗапускаРегламентныхЗаданийБезАктивныхПользователей"),
		НСтр("ru = 'Максимальный сдвиг запуска регламентных заданий без активных пользователей';
			|en = 'Maximum startup offset for idle scheduled jobs'"));
	
	Результат.Вставить(НРег("МинимальныйПериодЗапускаРегламентныхЗаданийБезАктивныхПользователей"),
		НСтр("ru = 'Минимальный период запуска регламентных заданий без активных пользователей';
			|en = 'Minimal startup period for idle scheduled jobs'"));
	
	Результат.Вставить(НРег("ОбязательноеИспользованиеВнешнегоУправленияСеансами"),
		НСтр("ru = 'Обязательное использование внешнего управления сеансами';
			|en = 'Mandatory external session management'"));
	
	Результат.Вставить(НРег("Описание"),
		НСтр("ru = 'Описание';
			|en = 'Details'"));
	
	Результат.Вставить(НРег("ПараметрБлокировки"),
		НСтр("ru = 'Параметр блокировки';
			|en = 'Lock parameter'"));
	
	Результат.Вставить(НРег("ПарольПользователяБазыДанных"),
		НСтр("ru = 'Пароль пользователя базы данных';
			|en = 'Database user password'"));
	
	Результат.Вставить(НРег("ПользовательБазыДанных"),
		НСтр("ru = 'Пользователь базы данных';
			|en = 'Database user'"));
	
	Результат.Вставить(НРег("ПрофильБезопасностиБезопасногоРежима"),
		НСтр("ru = 'Профиль безопасности безопасного режима';
			|en = 'Safe mode security profile'"));
	
	Результат.Вставить(НРег("РазрешитьВыдачуЛицензий"),
		НСтр("ru = 'Разрешить выдачу лицензий';
			|en = 'Allow issuing licenses'"));
	
	Результат.Вставить(НРег("РезервированиеРабочихПроцессов"),
		НСтр("ru = 'Резервирование рабочих процессов';
			|en = 'Working process reservation'"));
	
	Результат.Вставить(НРег("СерверБазДанных"),
		НСтр("ru = 'Сервер баз данных';
			|en = 'Database server'"));
	
	Результат.Вставить(НРег("СмещениеДат"),
		НСтр("ru = 'Смещение дат';
			|en = 'Dates offset'"));
	
	Результат.Вставить(НРег("СоздатьБазуДанных"),
		НСтр("ru = 'Создать базу данных';
			|en = 'Create database'"));
	
	Результат.Вставить(НРег("СообщениеБлокировки"),
		НСтр("ru = 'Сообщение блокировки';
			|en = 'Lock message'"));
	
	Результат.Вставить(НРег("СтрокаПараметровВнешнегоУправленияСеансами"),
		НСтр("ru = 'Строка параметров внешнего управления сеансами';
			|en = 'String of external session management parameters'"));
	
	Результат.Вставить(НРег("СУБД"),
		НСтр("ru = 'СУБД';
			|en = 'DBMS'"));
	
	Результат.Вставить(НРег("УровеньБезопасностиСоединений"),
		НСтр("ru = 'Уровень безопасности соединений';
			|en = 'Connection security level'"));
	
	// _$InfoBase$_.ConfigUpdate*
	Результат.Вставить(НРег("Поставщик"),
		НСтр("ru = 'Поставщик';
			|en = 'Vendor'"));
	
	// _$InfoBase$_.ConfigExtensionUpdate
	Результат.Вставить(НРег("Версия"),
		НСтр("ru = 'Версия';
			|en = 'Version'"));
	
	// _$InfoBase$_.DBConfigUpdate
	Результат.Вставить(НРег("МонопольныйРежим"),
		НСтр("ru = 'Монопольный режим';
			|en = 'Exclusive mode'"));
	
	// _$InfoBase$_.DBConfigExtension*
	Результат.Вставить(НРег("Активно"),
		НСтр("ru = 'Активно';
			|en = 'Active'"));
	
	Результат.Вставить(НРег("БезопасныйРежим"),
		НСтр("ru = 'Безопасный режим';
			|en = 'Safe mode'"));
	
	Результат.Вставить(НРег("ПрофильБезопасности"),
		НСтр("ru = 'Профиль безопасности';
			|en = 'Security profile'"));
	
	Результат.Вставить(НРег("ИспользоватьОсновныеРолиДляВсехПользователей"),
		НСтр("ru = 'Использовать основные роли для всех пользователей';
			|en = 'Use main roles for all users'"));
	
	Результат.Вставить(НРег("ИспользуетсяВРаспределеннойИнформационнойБазе"),
		НСтр("ru = 'Используется в распределенной информационной базе';
			|en = 'Used in a distributed infobase'"));
	
	Результат.Вставить(НРег("Назначение"),
		НСтр("ru = 'Назначение';
			|en = 'Used on'"));
	
	Результат.Вставить(НРег("ОбластьДействия"),
		НСтр("ru = 'Область действия';
			|en = 'Scope'"));
	
	Результат.Вставить(НРег("ОсновныеРоли"),
		НСтр("ru = 'Основные роли';
			|en = 'Default roles'"));
	
	Результат.Вставить(НРег("Синоним"),
		НСтр("ru = 'Синоним';
			|en = 'Synonym'"));
	
	Результат.Вставить(НРег("УникальныйИдентификатор"),
		НСтр("ru = 'Уникальный идентификатор';
			|en = 'UUID'"));
	
	Результат.Вставить(НРег("ХешСумма"),
		НСтр("ru = 'Хеш-сумма';
			|en = 'Hash'"));
	
	// _$InfoBase$_.EventLogReduce
	Результат.Вставить(НРег("Дата"),
		НСтр("ru = 'Дата';
			|en = 'Date'"));
	
	// _$InfoBase$_.EventLogSettingsUpdateError
	Результат.Вставить(НРег("Уровни"),
		НСтр("ru = 'Уровни';
			|en = 'Levels'"));
	
	Результат.Вставить(НРег("ПериодРазделения"),
		НСтр("ru = 'Период разделения';
			|en = 'Separation period'"));
	
	Результат.Вставить(НРег("ФорматЖурналаРегистрации"),
		НСтр("ru = 'Формат журнала регистрации';
			|en = 'Event log format'"));
	
	Результат.Вставить(НРег("ИмяСобытия"),
		НСтр("ru = 'Имя события';
			|en = 'Event name'"));
	
	Результат.Вставить(НРег("СобытиеРегистрируется"),
		НСтр("ru = 'Событие регистрируется';
			|en = 'Event loggable'"));
	
	// _$InfoBase$_.ExclusiveModeChange
	Результат.Вставить(НРег("РазрешитьЗавершатьПриНачалеСеанса"),
		НСтр("ru = 'Разрешить завершать при начале сеанса';
			|en = 'Allow exit on startup'"));
	
	// _$InfoBase$_.ParametersUpdate
	Результат.Вставить(НРег("ВремяОжиданияБлокировкиДанных"),
		НСтр("ru = 'Время ожидания блокировки данных';
			|en = 'Data lock wait time'"));
	
	Результат.Вставить(НРег("МаксимальныйСрокДействияПаролейПользователей"),
		НСтр("ru = 'Максимальный срок действия паролей пользователей';
			|en = 'Maximum password lifetime'"));
	
	Результат.Вставить(НРег("МинимальныйСрокДействияПаролейПользователей"),
		НСтр("ru = 'Минимальный срок действия паролей пользователей';
			|en = 'Minimum password lifetime'"));
	
	Результат.Вставить(НРег("МинимальнаяДлинаПаролейПользователей"),
		НСтр("ru = 'Минимальная длина паролей пользователей';
			|en = 'Minimum password length'"));
	
	Результат.Вставить(НРег("ОграничениеПовторенияПаролейПользователейСредиПоследних"),
		НСтр("ru = 'Ограничение повторения паролей пользователей среди последних';
			|en = 'Prevent re-use of recent passwords'"));
	
	Результат.Вставить(НРег("ПроверкаСложностиПаролейПользователей"),
		НСтр("ru = 'Проверка сложности паролей пользователей';
			|en = 'Password complexity check'"));
	
	Результат.Вставить(НРег("СрокПредупрежденияОбИстеченииСрокаДействияПаролейПользователей"),
		НСтр("ru = 'Срок предупреждения об истечении срока действия паролей пользователей';
			|en = 'Password expiration notification lead'"));
	
	Результат.Вставить(НРег("ВремяЗасыпанияПассивногоСеанса"),
		НСтр("ru = 'Время засыпания пассивного сеанса';
			|en = 'Idle session sleep timeout'"));
	
	Результат.Вставить(НРег("ВремяЗавершенияСпящегоСеанса"),
		НСтр("ru = 'Время завершения спящего сеанса';
			|en = 'Sleeping session termination timeout'"));
	
	Результат.Вставить(НРег("ВремяЗавершенияСеансаПриБездействии"),
		НСтр("ru = 'Время завершения сеанса при бездействии';
			|en = 'Inactive session termination timeout'"));
	
	Результат.Вставить(НРег("ВремяПредупрежденияОЗавершенииСеансаПриБездействии"),
		НСтр("ru = 'Время предупреждения о завершении сеанса при бездействии';
			|en = 'Lead time for inactive session termination notification'"));
	
	Результат.Вставить(НРег("КоличествоЗаданийПересчетаИтогов"),
		НСтр("ru = 'Количество заданий пересчета итогов';
			|en = 'Number of totals recalculation tasks'"));
	
	Результат.Вставить(НРег("МаксимальноеКоличествоНеуспешныхПопыток"),
		НСтр("ru = 'Максимальное количество неуспешных попыток';
			|en = 'Limit of unsuccessful attempts'"));
	
	Результат.Вставить(НРег("ДлительностьБлокировки"),
		НСтр("ru = 'Длительность блокировки';
			|en = 'Lock duration'"));
	
	Результат.Вставить(НРег("КодыДополненияИмениПользователя"),
		НСтр("ru = 'Коды дополнения имени пользователя';
			|en = 'Username addition codes'"));
	
	// _$InfoBase$_.RegionalSettingsChange
	Результат.Вставить(НРег("ИспользоватьНастройкиТекущегоСеанса"),
		НСтр("ru = 'Использовать настройки текущего сеанса';
			|en = 'Use current session settings'"));
	
	Результат.Вставить(НРег("КодЛокализации"),
		НСтр("ru = 'Код локализации';
			|en = 'Localization code'"));
	
	Результат.Вставить(НРег("ПервыйДеньНедели"),
		НСтр("ru = 'Первый день недели';
			|en = 'First day of the week'"));
	
	Результат.Вставить(НРег("ПредставлениеБулевоИстина"),
		НСтр("ru = 'Представление логического значения Истина';
			|en = 'Logical ""True"" presentation'"));
	
	Результат.Вставить(НРег("ПредставлениеБулевоЛожь"),
		НСтр("ru = 'Представление логического значения Ложь';
			|en = 'Logical ""False"" presentation'"));
	
	Результат.Вставить(НРег("ПредставлениеОтрицательныхЧисел"),
		НСтр("ru = 'Представление отрицательных чисел';
			|en = 'Negative numbers presentation'"));
	
	Результат.Вставить(НРег("РазделительГруппЦифрЧисел"),
		НСтр("ru = 'Разделитель групп цифр чисел';
			|en = 'Digit grouping separator'"));
	
	Результат.Вставить(НРег("РазделительДробнойЧастиЧисел"),
		НСтр("ru = 'Разделитель дробной части чисел';
			|en = 'Decimal separator'"));
	
	Результат.Вставить(НРег("ФорматГруппировкиЦифрЧисел"),
		НСтр("ru = 'Формат группировки цифр чисел';
			|en = 'Digit grouping format'"));
	
	Результат.Вставить(НРег("ФорматПредставленияВремени"),
		НСтр("ru = 'Формат представления времени';
			|en = 'Time format'"));
	
	Результат.Вставить(НРег("ФорматПредставленияДаты"),
		НСтр("ru = 'Формат представления даты';
			|en = 'Date format'"));
	
	// _$InfoBase$_.RoleUpdate
	Результат.Вставить(НРег("Права"),
		НСтр("ru = 'Права';
			|en = 'Access rights'"));
	
	Результат.Вставить(НРег("ДоступВключен"),
		НСтр("ru = 'Доступ включен';
			|en = 'Access granted'"));
	
	Результат.Вставить(НРег("ДоступВыключен"),
		НСтр("ru = 'Доступ выключен';
			|en = 'Access denied'"));
	
	Результат.Вставить(НРег("Ограничения"),
		НСтр("ru = 'Ограничения';
			|en = 'Restrictions'"));
	
	Результат.Вставить(НРег("ШаблоныОграничений"),
		НСтр("ru = 'Шаблоны ограничений';
			|en = 'Restriction templates'"));
	
	Результат.Вставить(НРег("Добавлены"),
		НСтр("ru = 'Добавлены';
			|en = 'Added'"));
	
	Результат.Вставить(НРег("Изменены"),
		НСтр("ru = 'Изменены';
			|en = 'Modified'"));
	
	Результат.Вставить(НРег("Удалены"),
		НСтр("ru = 'Удалены';
			|en = 'Deleted'"));
	
	Результат.Вставить(НРег("Наименование"),
		НСтр("ru = 'Наименование';
			|en = 'Description'"));
	
	Результат.Вставить(НРег("ТекстШаблона"),
		НСтр("ru = 'Текст шаблона';
			|en = 'Template text'"));
	
	// _$InfoBase$_.SecurityProfileChange
	Результат.Вставить(НРег("АдминистраторКластера"),
		НСтр("ru = 'Администратор кластера';
			|en = 'Cluster administrator'"));
	
	Результат.Вставить(НРег("ДоступККриптографии"),
		НСтр("ru = 'Доступ к криптографии';
			|en = 'Access to cryptography'"));
	
	Результат.Вставить(НРег("ДоступныеДляРасширенияМодули"),
		НСтр("ru = 'Доступные для расширения модули';
			|en = 'Extensible modules'"));
	
	Результат.Вставить(НРег("НедоступныеДляРасширенияМодули"),
		НСтр("ru = 'Недоступные для расширения модули';
			|en = 'Non-extensible modules'"));
	
	Результат.Вставить(НРег("ПолныйДоступКCOMОбъектам"),
		НСтр("ru = 'Полный доступ к COM-объектам';
			|en = 'Full access to COM objects'"));
	
	Результат.Вставить(НРег("ПолныйДоступКВнешнимКомпонентам"),
		НСтр("ru = 'Полный доступ к внешним компонентам';
			|en = 'Full access to add-ins'"));
	
	Результат.Вставить(НРег("ПолныйДоступКВнешнимМодулям"),
		НСтр("ru = 'Полный доступ к внешним модулям';
			|en = 'Full access to external modules'"));
	
	Результат.Вставить(НРег("ПолныйДоступКВнешнимПриложениям"),
		НСтр("ru = 'Полный доступ к внешним приложениям';
			|en = 'Unlimited access to external apps'"));
	
	Результат.Вставить(НРег("ПолныйДоступКИнтернетРесурсам"),
		НСтр("ru = 'Полный доступ к интернет ресурсам';
			|en = 'Full access to online resources'"));
	
	Результат.Вставить(НРег("ПолныйДоступКФайловойСистеме"),
		НСтр("ru = 'Полный доступ к файловой системе';
			|en = 'Full access to file system'"));
	
	Результат.Вставить(НРег("ПолныйПривилегированныйРежим"),
		НСтр("ru = 'Полный привилегированный режим';
			|en = 'Unlimited privileged mode'"));
	
	Результат.Вставить(НРег("ПрофильБезопасногоРежима"),
		НСтр("ru = 'Профиль безопасного режима';
			|en = 'Security mode profile'"));
	
	Результат.Вставить(НРег("РазрешитьВыполнениеВнешнегоКодаВНебезопасномРежиме"),
		НСтр("ru = 'Разрешить выполнение внешнего кода в небезопасном режиме';
			|en = 'Allow executing external code in unsafe mode'"));
	
	Результат.Вставить(НРег("РазрешитьРасширениеПравДоступа"),
		НСтр("ru = 'Разрешить расширение прав доступа';
			|en = 'Allow extension of access rights'"));
	
	Результат.Вставить(НРег("РолиОграничивающиеРасширениеПравДоступа"),
		НСтр("ru = 'Роли ограничивающие расширение прав доступа';
			|en = 'Roles preventing extension of access rights'"));
	
	Результат.Вставить(НРег("РолиПривилегированногоРежима"),
		НСтр("ru = 'Роли привилегированного режима';
			|en = 'Privileged mode roles'"));
	
	Результат.Вставить(НРег("РазрешенныеCOMКлассы"),
		НСтр("ru = 'Разрешенные COM-классы';
			|en = 'Allowed COM classes'"));
	
	Результат.Вставить(НРег("РазрешенныеВиртуальныеКаталоги"),
		НСтр("ru = 'Разрешенные виртуальные каталоги';
			|en = 'Allowed virtual directories'"));
	
	Результат.Вставить(НРег("ЗаписьРазрешена"),
		НСтр("ru = 'Запись разрешена';
			|en = 'Writing is allowed'"));
	
	Результат.Вставить(НРег("Псевдоним"),
		НСтр("ru = 'Псевдоним';
			|en = 'Alias'"));
	
	Результат.Вставить(НРег("ЧтениеРазрешено"),
		НСтр("ru = 'Чтение разрешено';
			|en = 'Reading is allowed'"));
	
	Результат.Вставить(НРег("РазрешенныеВнешниеКомпоненты"),
		НСтр("ru = 'Разрешенные внешние компоненты';
			|en = 'Allowed add-ins'"));
	
	Результат.Вставить(НРег("РазрешенныеВнешниеМодули"),
		НСтр("ru = 'Разрешенные внешние модули';
			|en = 'Allowed external modules'"));
	
	Результат.Вставить(НРег("РазрешенныеВнешниеПриложения"),
		НСтр("ru = 'Разрешенные внешние приложения';
			|en = 'Allowed external apps'"));
	
	Результат.Вставить(НРег("РазрешенныеИнтернетРесурсы"),
		НСтр("ru = 'Разрешенные интернет-ресурсы';
			|en = 'Allowed internet resources'"));
	
	Результат.Вставить(НРег("Адрес"),
		НСтр("ru = 'Адрес';
			|en = 'Address'"));
	
	Результат.Вставить(НРег("Порт"),
		НСтр("ru = 'Порт';
			|en = 'Port'"));
	
	Результат.Вставить(НРег("Протокол"),
		НСтр("ru = 'Протокол';
			|en = 'Protocol'"));
	
	Результат.Вставить(НРег("РазрешитьУстановкуПривилегированногоРежима"),
		НСтр("ru = 'Разрешить установку привилегированного режима';
			|en = 'Allow setting privileged mode'"));
	
	// _$InfoBase$_.SessionLockChange*
	Результат.Вставить(НРег("КодРазрешения"),
		НСтр("ru = 'Код разрешения';
			|en = 'Access code'"));
	
	Результат.Вставить(НРег("Конец"),
		НСтр("ru = 'Конец';
			|en = 'End'"));
	
	Результат.Вставить(НРег("Параметр"),
		НСтр("ru = 'Параметр';
			|en = 'Parameter'"));
	
	Результат.Вставить(НРег("Сообщение"),
		НСтр("ru = 'Сообщение';
			|en = 'Message'"));
	
	Результат.Вставить(НРег("Установлена"),
		НСтр("ru = 'Установлена';
			|en = 'Set'"));
	
	// _$InfoBase$_.UserPasswordPolicy*
	Результат.Вставить(НРег("МаксимальныйСрокДействияПаролей"),
		НСтр("ru = 'Максимальный срок действия паролей';
			|en = 'Maximum password lifetime'"));
	
	Результат.Вставить(НРег("МинимальныйСрокДействияПаролей"),
		НСтр("ru = 'Минимальный срок действия паролей';
			|en = 'Minimum password lifetime'"));
	
	Результат.Вставить(НРег("МинимальнаяДлинаПаролей"),
		НСтр("ru = 'Минимальная длина паролей';
			|en = 'Minimum password length'"));
	
	Результат.Вставить(НРег("ОграничениеПовторенияПаролейСредиПоследних"),
		НСтр("ru = 'Ограничение повторения паролей среди последних';
			|en = 'Prevent re-use of recent passwords'"));
	
	Результат.Вставить(НРег("ПроверкаСложностиПаролей"),
		НСтр("ru = 'Проверка сложности паролей';
			|en = 'Password complexity check'"));
	
	Результат.Вставить(НРег("СрокПредупрежденияОбИстеченииСрокаДействияПаролей"),
		НСтр("ru = 'Срок предупреждения об истечении срока действия паролей';
			|en = 'Password expiration notification lead'"));
	
	Результат.Вставить(НРег("ДействиеПриНесоответствииПаролейТребованиямПриАутентификации"),
		НСтр("ru = 'Действие при несоответствии паролей требованиям при аутентификации';
			|en = 'Action if password doesn''t meet requirements'"));
	
	Результат.Вставить(НРег("ПроверкаРаскрытияПаролей"),
		НСтр("ru = 'Проверка раскрытия паролей';
			|en = 'Leaked password check'"));
	
	// _$OpenIDProvider$_.*
	Результат.Вставить(НРег("URLДоверяющейСтороны"),
		НСтр("ru = 'URL доверяющей стороны';
			|en = 'Relying party URL'"));
	
	// _$Session$_.Authentication*
	Результат.Вставить(НРег("ТекущийПользовательОС"),
		НСтр("ru = 'Текущий пользователь ОС';
			|en = 'Current OS user'"));
	
	Результат.Вставить(НРег("СпособАутентификации"),
		НСтр("ru = 'Способ аутентификации';
			|en = 'Authentication method'"));
	
	Результат.Вставить(НРег("КодДополненияИмениПользователя"),
		НСтр("ru = 'Код дополнения имени пользователя';
			|en = 'Username addition code'"));
	
	Результат.Вставить(НРег("ИдентификаторПользователяПровайдераOpenID"),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Идентификатор пользователя провайдера %1';
				|en = '%1 provider user ID'"), "OpenID"));
	
	Результат.Вставить(НРег("ЭмитентТокенаДоступа"),
		НСтр("ru = 'Эмитент токена доступа';
			|en = 'Access token emitter'"));
	
	Результат.Вставить(НРег("ИдентификаторТокенаДоступа"),
		НСтр("ru = 'Идентификатор токена доступа';
			|en = 'Access token ID'"));
	
	Результат.Вставить(НРег("URLПровайдераOpenID"),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'URL провайдера %1';
				|en = '%1 provider URL'"), "OpenID"));
	
	// _$Session$_.ExternalDataProcessorConnect*
	Результат.Вставить(НРег("Путь"),
		НСтр("ru = 'Путь';
			|en = 'Path'"));
	
	Результат.Вставить(НРег("КодЯзыка"),
		НСтр("ru = 'Код языка';
			|en = 'Language code'"));
	
	// _$Session$_.AddInAttach*
	Результат.Вставить(НРег("Местоположение"),
		НСтр("ru = 'Местоположение';
			|en = 'Location'"));
	
	Результат.Вставить(НРег("Тип"),
		НСтр("ru = 'Тип';
			|en = 'Type'"));
	
	Результат.Вставить(НРег("ТипПодключения"),
		НСтр("ru = 'Тип подключения';
			|en = 'Connection type'"));
	
	// _$User$_.*
	Результат.Вставить(НРег("АдресЭлектроннойПочты"),
		НСтр("ru = 'Адрес электронной почты';
			|en = 'Email address'"));
	
	Результат.Вставить(НРег("АутентификацияOpenID"),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Аутентификация %1';
				|en = '%1 authentication'"), "OpenID"));
	
	Результат.Вставить(НРег("АутентификацияOpenIDConnect"),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Аутентификация %1';
				|en = '%1 authentication'"), "OpenID-Connect"));
	
	Результат.Вставить(НРег("АутентификацияQRКодом"),
		НСтр("ru = 'Аутентификация QR кодом';
			|en = 'QR code authentication'"));
	
	Результат.Вставить(НРег("АутентификацияОС"),
		НСтр("ru = 'Аутентификация ОС';
			|en = 'OS authentication'"));
	
	Результат.Вставить(НРег("АутентификацияСтандартная"),
		НСтр("ru = 'Аутентификация 1С:Предприятия';
			|en = '1C:Enterprise authentication'"));
	
	Результат.Вставить(НРег("АутентификацияТокеномДоступа"),
		НСтр("ru = 'Аутентификация токеном доступа';
			|en = 'Access token authentication'"));
	
	Результат.Вставить(НРег("ДатаУстановкиПароля"),
		НСтр("ru = 'Дата установки пароля';
			|en = 'Password set date'"));
	
	Результат.Вставить(НРег("ЗапрещеноВосстанавливатьПароль"),
		НСтр("ru = 'Запрещено восстанавливать пароль';
			|en = 'User cannot recover password'"));
	
	Результат.Вставить(НРег("ЗапрещеноИзменятьПароль"),
		НСтр("ru = 'Запрещено изменять пароль';
			|en = 'User cannot change password'"));
	
	Результат.Вставить(НРег("ЗащитаОтОпасныхДействий"),
		НСтр("ru = 'Защита от опасных действий';
			|en = 'Unsafe action protection'"));
	
	Результат.Вставить(НРег("Имя"),
		НСтр("ru = 'Имя';
			|en = 'Name'"));
	
	Результат.Вставить(НРег("ИмяПолитикиПаролей"),
		НСтр("ru = 'Имя политики паролей';
			|en = 'Password policy name'"));
	
	Результат.Вставить(НРег("КлючиСопоставленияПользователя"),
		НСтр("ru = 'Ключи сопоставления пользователя';
			|en = 'User map keys'"));
	
	Результат.Вставить(НРег("НастройкиВторогоФактораАутентификации"),
		НСтр("ru = 'Настройки второго фактора аутентификации';
			|en = 'Second authentication factor settings'"));
	
	Результат.Вставить(НРег("ОбработкаНастроекВторогоФактораАутентификации"),
		НСтр("ru = 'Обработка настроек второго фактора аутентификации';
			|en = 'Second authentication factor settings processing'"));
	
	Результат.Вставить(НРег("ПарольИзменен"),
		НСтр("ru = 'Пароль изменен';
			|en = 'Password is changed'"));
	
	Результат.Вставить(НРег("ПарольНеСоответствуетТребованиям"),
		НСтр("ru = 'Пароль не соответствует требованиям';
			|en = 'Password does not meet requirements'"));
	
	Результат.Вставить(НРег("ПарольУстановлен"),
		НСтр("ru = 'Пароль установлен';
			|en = 'Password is set'"));
	
	Результат.Вставить(НРег("ПоказыватьВСпискеВыбора"),
		НСтр("ru = 'Показывать в списке выбора';
			|en = 'Show in list'"));
	
	Результат.Вставить(НРег("ПолноеИмя"),
		НСтр("ru = 'Полное имя';
			|en = 'Full name'"));
	
	Результат.Вставить(НРег("ПользовательОС"),
		НСтр("ru = 'Пользователь ОС';
			|en = 'OS user'"));
	
	Результат.Вставить(НРег("РежимЗапуска"),
		НСтр("ru = 'Режим запуска';
			|en = 'Run mode'"));
	
	Результат.Вставить(НРег("ОсновнойИнтерфейс"),
		НСтр("ru = 'Основной интерфейс';
			|en = 'Main interface'"));
	
	Результат.Вставить(НРег("Роли"),
		НСтр("ru = 'Роли';
			|en = 'Roles'"));
	
	Результат.Вставить(НРег("ТипАлгоритмаХешированияПароля"),
		НСтр("ru = 'Тип алгоритма хеширования пароля';
			|en = 'Password hashing algorithm type'"));
	
	Результат.Вставить(НРег("Язык"),
		НСтр("ru = 'Язык';
			|en = 'Language'"));
	
	Результат.Вставить(НРег("Пользователи"),
		НСтр("ru = 'Пользователи';
			|en = 'Users'"));
	
	Результат.Вставить(НРег("РазделениеДанных"),
		НСтр("ru = 'Разделение данных';
			|en = 'Data separation'"));
	
	Возврат Результат;
	
КонецФункции